<?php

return [
    'city0' => [
        'name' => 'Абаза',
        'latitude' => '52.6517296',
        'longitude' => '90.0885929',
    ],
    'city1' => [
        'name' => 'Абакан',
        'latitude' => '53.7223661',
        'longitude' => '91.4437792',
    ],
    'city2' => [
        'name' => 'Абдулино',
        'latitude' => '53.6778096',
        'longitude' => '53.6473115',
    ],
    'city3' => [
        'name' => 'Абинск',
        'latitude' => '44.8679931',
        'longitude' => '38.1618437',
    ],
    'city4' => [
        'name' => 'Агидель',
        'latitude' => '55.89976',
        'longitude' => '53.9221149',
    ],
    'city5' => [
        'name' => 'Агрыз',
        'latitude' => '56.5232645',
        'longitude' => '52.994257',
    ],
    'city6' => [
        'name' => 'Адыгейск',
        'latitude' => '44.8783715',
        'longitude' => '39.190172',
    ],
    'city7' => [
        'name' => 'Азнакаево',
        'latitude' => '54.8599054',
        'longitude' => '53.0745505',
    ],
    'city8' => [
        'name' => 'Азов',
        'latitude' => '47.1120631',
        'longitude' => '39.4232597',
    ],
    'city9' => [
        'name' => 'Ак-Довурак',
        'latitude' => '51.1785658',
        'longitude' => '90.5984511',
    ],
    'city10' => [
        'name' => 'Аксай',
        'latitude' => '47.2676075',
        'longitude' => '39.8755485',
    ],
    'city11' => [
        'name' => 'Алагир',
        'latitude' => '43.0416151',
        'longitude' => '44.2198622',
    ],
    'city12' => [
        'name' => 'Алапаевск',
        'latitude' => '57.8475542',
        'longitude' => '61.6693934',
    ],
    'city13' => [
        'name' => 'Алатырь',
        'latitude' => '54.8398179',
        'longitude' => '46.5721423',
    ],
    'city14' => [
        'name' => 'Алдан',
        'latitude' => '58.6094885',
        'longitude' => '125.3816689',
    ],
    'city15' => [
        'name' => 'Алейск',
        'latitude' => '52.4920914',
        'longitude' => '82.7794145',
    ],
    'city16' => [
        'name' => 'Александров',
        'latitude' => '56.3919652',
        'longitude' => '38.711035',
    ],
    'city17' => [
        'name' => 'Александровск',
        'latitude' => '59.1613773',
        'longitude' => '57.5764851',
    ],
    'city18' => [
        'name' => 'Александровск-Сахалинский',
        'latitude' => '50.8973664',
        'longitude' => '142.1579322',
    ],
    'city19' => [
        'name' => 'Алексеевка',
        'latitude' => '50.6299932',
        'longitude' => '38.6881776',
    ],
    'city20' => [
        'name' => 'Алексин',
        'latitude' => '54.5083788',
        'longitude' => '37.047891',
    ],
    'city21' => [
        'name' => 'Алзамай',
        'latitude' => '55.5550493',
        'longitude' => '98.6644106',
    ],
    'city22' => [
        'name' => 'Алушта',
        'latitude' => '44.6764419',
        'longitude' => '34.4100387',
    ],
    'city23' => [
        'name' => 'Альметьевск',
        'latitude' => '54.9013662',
        'longitude' => '52.2970654',
    ],
    'city24' => [
        'name' => 'Амурск',
        'latitude' => '50.2345017',
        'longitude' => '136.8791135',
    ],
    'city25' => [
        'name' => 'Анадырь',
        'latitude' => '64.7314347',
        'longitude' => '177.5015752',
    ],
    'city26' => [
        'name' => 'Анапа',
        'latitude' => '44.8950777',
        'longitude' => '37.3163142',
    ],
    'city27' => [
        'name' => 'Ангарск',
        'latitude' => '52.5448102',
        'longitude' => '103.8885385',
    ],
    'city28' => [
        'name' => 'Андреаполь',
        'latitude' => '56.6507072',
        'longitude' => '32.2621196',
    ],
    'city29' => [
        'name' => 'Анжеро-Судженск',
        'latitude' => '56.0787179',
        'longitude' => '86.0202207',
    ],
    'city30' => [
        'name' => 'Анива',
        'latitude' => '46.7132526',
        'longitude' => '142.5265052',
    ],
    'city31' => [
        'name' => 'Апатиты',
        'latitude' => '67.5678295',
        'longitude' => '33.4067218',
    ],
    'city32' => [
        'name' => 'Апрелевка',
        'latitude' => '55.5276336',
        'longitude' => '37.0651105',
    ],
    'city33' => [
        'name' => 'Апшеронск',
        'latitude' => '44.4585239',
        'longitude' => '39.7300092',
    ],
    'city34' => [
        'name' => 'Арамиль',
        'latitude' => '56.6945341',
        'longitude' => '60.8343825',
    ],
    'city35' => [
        'name' => 'Аргун',
        'latitude' => '43.2918071',
        'longitude' => '45.8724383',
    ],
    'city36' => [
        'name' => 'Ардатов',
        'latitude' => '54.8465693',
        'longitude' => '46.2412736',
    ],
    'city37' => [
        'name' => 'Ардон',
        'latitude' => '43.1756719',
        'longitude' => '44.2955701',
    ],
    'city38' => [
        'name' => 'Арзамас',
        'latitude' => '55.3947544',
        'longitude' => '43.8407855',
    ],
    'city39' => [
        'name' => 'Аркадак',
        'latitude' => '51.9387813',
        'longitude' => '43.4997558',
    ],
    'city40' => [
        'name' => 'Армавир',
        'latitude' => '45.0010338',
        'longitude' => '41.132392',
    ],
    'city41' => [
        'name' => 'Армянск',
        'latitude' => '46.1059247',
        'longitude' => '33.6910325',
    ],
    'city42' => [
        'name' => 'Арсеньев',
        'latitude' => '44.16208',
        'longitude' => '133.269622',
    ],
    'city43' => [
        'name' => 'Арск',
        'latitude' => '56.0913636',
        'longitude' => '49.8770441',
    ],
    'city44' => [
        'name' => 'Артем',
        'latitude' => '43.350053',
        'longitude' => '132.1596594',
    ],
    'city45' => [
        'name' => 'Артемовск',
        'latitude' => '54.3472901',
        'longitude' => '93.4356543',
    ],
    'city46' => [
        'name' => 'Артемовский',
        'latitude' => '57.3384162',
        'longitude' => '61.8946599',
    ],
    'city47' => [
        'name' => 'Архангельск',
        'latitude' => '64.5392985',
        'longitude' => '40.5170083',
    ],
    'city48' => [
        'name' => 'Асбест',
        'latitude' => '57.0052428',
        'longitude' => '61.4581071',
    ],
    'city49' => [
        'name' => 'Асино',
        'latitude' => '56.9908444',
        'longitude' => '86.1765724',
    ],
    'city50' => [
        'name' => 'Астрахань',
        'latitude' => '46.3655808',
        'longitude' => '48.0559979',
    ],
    'city51' => [
        'name' => 'Аткарск',
        'latitude' => '51.8736331',
        'longitude' => '45.0003199',
    ],
    'city52' => [
        'name' => 'Ахтубинск',
        'latitude' => '48.2753078',
        'longitude' => '46.1906741',
    ],
    'city53' => [
        'name' => 'Ачинск',
        'latitude' => '56.2538662',
        'longitude' => '90.47949',
    ],
    'city54' => [
        'name' => 'Аша',
        'latitude' => '54.9907105',
        'longitude' => '57.2783704',
    ],
    'city55' => [
        'name' => 'Бабаево',
        'latitude' => '59.389309',
        'longitude' => '35.9378318',
    ],
    'city56' => [
        'name' => 'Бабушкин',
        'latitude' => '51.7113066',
        'longitude' => '105.8673633',
    ],
    'city57' => [
        'name' => 'Бавлы',
        'latitude' => '54.4063588',
        'longitude' => '53.2457946',
    ],
    'city58' => [
        'name' => 'Багратионовск',
        'latitude' => '54.3866976',
        'longitude' => '20.6418545',
    ],
    'city59' => [
        'name' => 'Байкальск',
        'latitude' => '51.5231282',
        'longitude' => '104.1485752',
    ],
    'city60' => [
        'name' => 'Баймак',
        'latitude' => '52.5912632',
        'longitude' => '58.3111995',
    ],
    'city61' => [
        'name' => 'Бакал',
        'latitude' => '54.9406759',
        'longitude' => '58.8051085',
    ],
    'city62' => [
        'name' => 'Баксан',
        'latitude' => '43.6820621',
        'longitude' => '43.5345627',
    ],
    'city63' => [
        'name' => 'Балабаново',
        'latitude' => '55.1773652',
        'longitude' => '36.6567255',
    ],
    'city64' => [
        'name' => 'Балаково',
        'latitude' => '52.0222694',
        'longitude' => '47.7828146',
    ],
    'city65' => [
        'name' => 'Балахна',
        'latitude' => '56.4949932',
        'longitude' => '43.5758953',
    ],
    'city66' => [
        'name' => 'Балашиха',
        'latitude' => '55.7963352',
        'longitude' => '37.9381413',
    ],
    'city67' => [
        'name' => 'Балашов',
        'latitude' => '51.5389502',
        'longitude' => '43.1839828',
    ],
    'city68' => [
        'name' => 'Балей',
        'latitude' => '51.5822063',
        'longitude' => '116.6380088',
    ],
    'city69' => [
        'name' => 'Балтийск',
        'latitude' => '54.6514128',
        'longitude' => '19.9141911',
    ],
    'city70' => [
        'name' => 'Барабинск',
        'latitude' => '55.3515917',
        'longitude' => '78.3465012',
    ],
    'city71' => [
        'name' => 'Барнаул',
        'latitude' => '53.3481145',
        'longitude' => '83.7798362',
    ],
    'city72' => [
        'name' => 'Барыш',
        'latitude' => '53.6534563',
        'longitude' => '47.1180805',
    ],
    'city73' => [
        'name' => 'Батайск',
        'latitude' => '47.138321',
        'longitude' => '39.7508382',
    ],
    'city74' => [
        'name' => 'Бахчисарай',
        'latitude' => '44.751388',
        'longitude' => '33.8750341',
    ],
    'city75' => [
        'name' => 'Бежецк',
        'latitude' => '57.7861144',
        'longitude' => '36.6903445',
    ],
    'city76' => [
        'name' => 'Белая Калитва',
        'latitude' => '48.176948',
        'longitude' => '40.8033169',
    ],
    'city77' => [
        'name' => 'Белая Холуница',
        'latitude' => '58.8415212',
        'longitude' => '50.8461002',
    ],
    'city78' => [
        'name' => 'Белгород',
        'latitude' => '50.5977351',
        'longitude' => '36.5858236',
    ],
    'city79' => [
        'name' => 'Белебей',
        'latitude' => '54.1033832',
        'longitude' => '54.1111878',
    ],
    'city80' => [
        'name' => 'Белев',
        'latitude' => '53.8113348',
        'longitude' => '36.1383153',
    ],
    'city81' => [
        'name' => 'Белинский',
        'latitude' => '52.9641169',
        'longitude' => '43.4185003',
    ],
    'city82' => [
        'name' => 'Белово',
        'latitude' => '54.4221442',
        'longitude' => '86.3036438',
    ],
    'city83' => [
        'name' => 'Белогорск',
        'latitude' => '50.9212235',
        'longitude' => '128.4738742',
    ],
    'city84' => [
        'name' => 'Белозерск',
        'latitude' => '60.0307914',
        'longitude' => '37.7891123',
    ],
    'city85' => [
        'name' => 'Белокуриха',
        'latitude' => '51.9960534',
        'longitude' => '84.9840343',
    ],
    'city86' => [
        'name' => 'Беломорск',
        'latitude' => '64.5378468',
        'longitude' => '34.7799717',
    ],
    'city87' => [
        'name' => 'Белорецк',
        'latitude' => '53.9675927',
        'longitude' => '58.4099562',
    ],
    'city88' => [
        'name' => 'Белореченск',
        'latitude' => '44.7652733',
        'longitude' => '39.8780457',
    ],
    'city89' => [
        'name' => 'Белоусово',
        'latitude' => '55.0957679',
        'longitude' => '36.6777239',
    ],
    'city90' => [
        'name' => 'Белоярский',
        'latitude' => '63.712181',
        'longitude' => '66.6772357',
    ],
    'city91' => [
        'name' => 'Белый',
        'latitude' => '55.8337663',
        'longitude' => '32.9388976',
    ],
    'city92' => [
        'name' => 'Бердск',
        'latitude' => '54.7582375',
        'longitude' => '83.1072212',
    ],
    'city93' => [
        'name' => 'Березники',
        'latitude' => '59.4079898',
        'longitude' => '56.8040725',
    ],
    'city94' => [
        'name' => 'Березовский',
        'latitude' => '55.6692853',
        'longitude' => '86.2744636',
    ],
    'city95' => [
        'name' => 'Беслан',
        'latitude' => '43.1937634',
        'longitude' => '44.5338746',
    ],
    'city96' => [
        'name' => 'Бийск',
        'latitude' => '52.5393683',
        'longitude' => '85.2138852',
    ],
    'city97' => [
        'name' => 'Бикин',
        'latitude' => '46.8186244',
        'longitude' => '134.2551046',
    ],
    'city98' => [
        'name' => 'Билибино',
        'latitude' => '68.0585533',
        'longitude' => '166.4388451',
    ],
    'city99' => [
        'name' => 'Биробиджан',
        'latitude' => '48.7945975',
        'longitude' => '132.9217594',
    ],
    'city100' => [
        'name' => 'Бирск',
        'latitude' => '55.4157107',
        'longitude' => '55.5582335',
    ],
    'city101' => [
        'name' => 'Бирюсинск',
        'latitude' => '55.9608611',
        'longitude' => '97.8203624',
    ],
    'city102' => [
        'name' => 'Бирюч',
        'latitude' => '50.6483899',
        'longitude' => '38.4006203',
    ],
    'city103' => [
        'name' => 'Благовещенск',
        'latitude' => '50.2905935',
        'longitude' => '127.5272186',
    ],
    'city104' => [
        'name' => 'Благодарный',
        'latitude' => '45.0990834',
        'longitude' => '43.4307042',
    ],
    'city105' => [
        'name' => 'Бобров',
        'latitude' => '51.0902048',
        'longitude' => '40.0320014',
    ],
    'city106' => [
        'name' => 'Богданович',
        'latitude' => '56.7764419',
        'longitude' => '62.0463692',
    ],
    'city107' => [
        'name' => 'Богородицк',
        'latitude' => '53.7700516',
        'longitude' => '38.1225308',
    ],
    'city108' => [
        'name' => 'Богородск',
        'latitude' => '56.1019905',
        'longitude' => '43.513678',
    ],
    'city109' => [
        'name' => 'Боготол',
        'latitude' => '56.209881',
        'longitude' => '89.5300182',
    ],
    'city110' => [
        'name' => 'Богучар',
        'latitude' => '49.9352997',
        'longitude' => '40.5592467',
    ],
    'city111' => [
        'name' => 'Бодайбо',
        'latitude' => '57.8468822',
        'longitude' => '114.1867148',
    ],
    'city112' => [
        'name' => 'Бокситогорск',
        'latitude' => '59.4735032',
        'longitude' => '33.8456521',
    ],
    'city113' => [
        'name' => 'Болгар',
        'latitude' => '54.9748862',
        'longitude' => '49.0302977',
    ],
    'city114' => [
        'name' => 'Бологое',
        'latitude' => '57.885655',
        'longitude' => '34.0536895',
    ],
    'city115' => [
        'name' => 'Болотное',
        'latitude' => '55.6693773',
        'longitude' => '84.3906599',
    ],
    'city116' => [
        'name' => 'Болохово',
        'latitude' => '54.0820644',
        'longitude' => '37.826844',
    ],
    'city117' => [
        'name' => 'Болхов',
        'latitude' => '53.4440204',
        'longitude' => '36.0076969',
    ],
    'city118' => [
        'name' => 'Большой Камень',
        'latitude' => '43.1112737',
        'longitude' => '132.3480354',
    ],
    'city119' => [
        'name' => 'Бор',
        'latitude' => '56.3565179',
        'longitude' => '44.0644851',
    ],
    'city120' => [
        'name' => 'Борзя',
        'latitude' => '50.3875437',
        'longitude' => '116.5235682',
    ],
    'city121' => [
        'name' => 'Борисоглебск',
        'latitude' => '51.3654619',
        'longitude' => '42.100947',
    ],
    'city122' => [
        'name' => 'Боровичи',
        'latitude' => '58.3839866',
        'longitude' => '33.9176761',
    ],
    'city123' => [
        'name' => 'Боровск',
        'latitude' => '55.2130965',
        'longitude' => '36.4927446',
    ],
    'city124' => [
        'name' => 'Бородино',
        'latitude' => '55.9054308',
        'longitude' => '94.9021138',
    ],
    'city125' => [
        'name' => 'Братск',
        'latitude' => '56.1513951',
        'longitude' => '101.6339892',
    ],
    'city126' => [
        'name' => 'Бронницы',
        'latitude' => '55.4255534',
        'longitude' => '38.2640794',
    ],
    'city127' => [
        'name' => 'Брянск',
        'latitude' => '53.2420071',
        'longitude' => '34.3652716',
    ],
    'city128' => [
        'name' => 'Бугульма',
        'latitude' => '54.5363428',
        'longitude' => '52.7895286',
    ],
    'city129' => [
        'name' => 'Бугуруслан',
        'latitude' => '53.6522636',
        'longitude' => '52.4326166',
    ],
    'city130' => [
        'name' => 'Буденновск',
        'latitude' => '44.7814437',
        'longitude' => '44.1650859',
    ],
    'city131' => [
        'name' => 'Бузулук',
        'latitude' => '52.7881434',
        'longitude' => '52.2623757',
    ],
    'city132' => [
        'name' => 'Буинск',
        'latitude' => '54.9641106',
        'longitude' => '48.2900576',
    ],
    'city133' => [
        'name' => 'Буй',
        'latitude' => '58.473445',
        'longitude' => '41.5306746',
    ],
    'city134' => [
        'name' => 'Буйнакск',
        'latitude' => '42.8213799',
        'longitude' => '47.1164452',
    ],
    'city135' => [
        'name' => 'Бутурлиновка',
        'latitude' => '50.8313227',
        'longitude' => '40.5977541',
    ],
    'city136' => [
        'name' => 'Валдай',
        'latitude' => '57.9822906',
        'longitude' => '33.2369492',
    ],
    'city137' => [
        'name' => 'Валуйки',
        'latitude' => '50.2112799',
        'longitude' => '38.0998765',
    ],
    'city138' => [
        'name' => 'Велиж',
        'latitude' => '55.6058845',
        'longitude' => '31.1857376',
    ],
    'city139' => [
        'name' => 'Великие Луки',
        'latitude' => '56.3321847',
        'longitude' => '30.550757',
    ],
    'city140' => [
        'name' => 'Великий Новгород',
        'latitude' => '58.5214003',
        'longitude' => '31.2755051',
    ],
    'city141' => [
        'name' => 'Великий Устюг',
        'latitude' => '60.7603243',
        'longitude' => '46.3053893',
    ],
    'city142' => [
        'name' => 'Вельск',
        'latitude' => '61.0660057',
        'longitude' => '42.1032858',
    ],
    'city143' => [
        'name' => 'Венев',
        'latitude' => '54.3542431',
        'longitude' => '38.2642325',
    ],
    'city144' => [
        'name' => 'Верещагино',
        'latitude' => '58.0797908',
        'longitude' => '54.6580948',
    ],
    'city145' => [
        'name' => 'Верея',
        'latitude' => '55.3674668',
        'longitude' => '36.1563083',
    ],
    'city146' => [
        'name' => 'Верхнеуральск',
        'latitude' => '53.8760587',
        'longitude' => '59.2169071',
    ],
    'city147' => [
        'name' => 'Верхний Тагил',
        'latitude' => '57.3762768',
        'longitude' => '59.9516521',
    ],
    'city148' => [
        'name' => 'Верхний Уфалей',
        'latitude' => '56.0487252',
        'longitude' => '60.231963',
    ],
    'city149' => [
        'name' => 'Верхняя Пышма',
        'latitude' => '56.9757833',
        'longitude' => '60.564885',
    ],
    'city150' => [
        'name' => 'Верхняя Салда',
        'latitude' => '58.0466039',
        'longitude' => '60.5560397',
    ],
    'city151' => [
        'name' => 'Верхняя Тура',
        'latitude' => '58.3643839',
        'longitude' => '59.8266854',
    ],
    'city152' => [
        'name' => 'Верхотурье',
        'latitude' => '58.8621145',
        'longitude' => '60.8104543',
    ],
    'city153' => [
        'name' => 'Верхоянск',
        'latitude' => '67.5500865',
        'longitude' => '133.3907829',
    ],
    'city154' => [
        'name' => 'Весьегонск',
        'latitude' => '58.6584004',
        'longitude' => '37.2568605',
    ],
    'city155' => [
        'name' => 'Ветлуга',
        'latitude' => '57.8558395',
        'longitude' => '45.7762692',
    ],
    'city156' => [
        'name' => 'Видное',
        'latitude' => '55.5518323',
        'longitude' => '37.7062062',
    ],
    'city157' => [
        'name' => 'Вилюйск',
        'latitude' => '63.7517314',
        'longitude' => '121.6272754',
    ],
    'city158' => [
        'name' => 'Вилючинск',
        'latitude' => '52.930428',
        'longitude' => '158.4057276',
    ],
    'city159' => [
        'name' => 'Вихоревка',
        'latitude' => '56.1207708',
        'longitude' => '101.170332',
    ],
    'city160' => [
        'name' => 'Вичуга',
        'latitude' => '57.2044545',
        'longitude' => '41.9131192',
    ],
    'city161' => [
        'name' => 'Владивосток',
        'latitude' => '43.1163807',
        'longitude' => '131.882348',
    ],
    'city162' => [
        'name' => 'Владикавказ',
        'latitude' => '43.0205039',
        'longitude' => '44.6819383',
    ],
    'city163' => [
        'name' => 'Владимир',
        'latitude' => '56.1281561',
        'longitude' => '40.4082995',
    ],
    'city164' => [
        'name' => 'Волгоград',
        'latitude' => '48.7072005',
        'longitude' => '44.5170207',
    ],
    'city165' => [
        'name' => 'Волгодонск',
        'latitude' => '47.5165181',
        'longitude' => '42.1984531',
    ],
    'city166' => [
        'name' => 'Волгореченск',
        'latitude' => '57.4423712',
        'longitude' => '41.1593076',
    ],
    'city167' => [
        'name' => 'Волжск',
        'latitude' => '55.8622987',
        'longitude' => '48.371553',
    ],
    'city168' => [
        'name' => 'Волжский',
        'latitude' => '48.7978483',
        'longitude' => '44.7462417',
    ],
    'city169' => [
        'name' => 'Вологда',
        'latitude' => '59.2484186',
        'longitude' => '39.8356461',
    ],
    'city170' => [
        'name' => 'Володарск',
        'latitude' => '56.2168974',
        'longitude' => '43.1597623',
    ],
    'city171' => [
        'name' => 'Волоколамск',
        'latitude' => '56.0358121',
        'longitude' => '35.9585027',
    ],
    'city172' => [
        'name' => 'Волосово',
        'latitude' => '59.4445107',
        'longitude' => '29.492277',
    ],
    'city173' => [
        'name' => 'Волхов',
        'latitude' => '59.9006057',
        'longitude' => '32.35212',
    ],
    'city174' => [
        'name' => 'Волчанск',
        'latitude' => '59.9350515',
        'longitude' => '60.0797964',
    ],
    'city175' => [
        'name' => 'Вольск',
        'latitude' => '52.0459932',
        'longitude' => '47.3873504',
    ],
    'city176' => [
        'name' => 'Воркута',
        'latitude' => '67.4973484',
        'longitude' => '64.0611045',
    ],
    'city177' => [
        'name' => 'Воронеж',
        'latitude' => '51.6592378',
        'longitude' => '39.1968284',
    ],
    'city178' => [
        'name' => 'Ворсма',
        'latitude' => '55.9900425',
        'longitude' => '43.2719879',
    ],
    'city179' => [
        'name' => 'Воскресенск',
        'latitude' => '55.3071305',
        'longitude' => '38.7026949',
    ],
    'city180' => [
        'name' => 'Воткинск',
        'latitude' => '57.0517641',
        'longitude' => '53.9874635',
    ],
    'city181' => [
        'name' => 'Всеволожск',
        'latitude' => '60.0190094',
        'longitude' => '30.6455834',
    ],
    'city182' => [
        'name' => 'Вуктыл',
        'latitude' => '63.8615209',
        'longitude' => '57.3165207',
    ],
    'city183' => [
        'name' => 'Выборг',
        'latitude' => '60.7130748',
        'longitude' => '28.7328813',
    ],
    'city184' => [
        'name' => 'Выкса',
        'latitude' => '55.3207103',
        'longitude' => '42.1679169',
    ],
    'city185' => [
        'name' => 'Высоковск',
        'latitude' => '56.336141',
        'longitude' => '36.5251316',
    ],
    'city186' => [
        'name' => 'Высоцк',
        'latitude' => '60.6296511',
        'longitude' => '28.5709914',
    ],
    'city187' => [
        'name' => 'Вытегра',
        'latitude' => '61.0064157',
        'longitude' => '36.4495835',
    ],
    'city188' => [
        'name' => 'Вышний Волочек',
        'latitude' => '57.5683326',
        'longitude' => '34.5402931',
    ],
    'city189' => [
        'name' => 'Вяземский',
        'latitude' => '47.5354416',
        'longitude' => '134.7553701',
    ],
    'city190' => [
        'name' => 'Вязники',
        'latitude' => '56.2976528',
        'longitude' => '42.2687311',
    ],
    'city191' => [
        'name' => 'Вязьма',
        'latitude' => '55.2115563',
        'longitude' => '34.2951196',
    ],
    'city192' => [
        'name' => 'Вятские Поляны',
        'latitude' => '56.2286058',
        'longitude' => '51.0614666',
    ],
    'city193' => [
        'name' => 'Гаврилов Посад',
        'latitude' => '56.5585967',
        'longitude' => '40.1228288',
    ],
    'city194' => [
        'name' => 'Гаврилов-Ям',
        'latitude' => '57.3091552',
        'longitude' => '39.8545157',
    ],
    'city195' => [
        'name' => 'Гагарин',
        'latitude' => '55.5526532',
        'longitude' => '34.9949049',
    ],
    'city196' => [
        'name' => 'Гаджиево',
        'latitude' => '69.2490009',
        'longitude' => '33.3152445',
    ],
    'city197' => [
        'name' => 'Гай',
        'latitude' => '51.4649138',
        'longitude' => '58.4436189',
    ],
    'city198' => [
        'name' => 'Галич',
        'latitude' => '58.3826861',
        'longitude' => '42.3654563',
    ],
    'city199' => [
        'name' => 'Гатчина',
        'latitude' => '59.5650861',
        'longitude' => '30.1281859',
    ],
    'city200' => [
        'name' => 'Гвардейск',
        'latitude' => '54.6588981',
        'longitude' => '21.0500584',
    ],
    'city201' => [
        'name' => 'Гдов',
        'latitude' => '58.7432585',
        'longitude' => '27.8263328',
    ],
    'city202' => [
        'name' => 'Геленджик',
        'latitude' => '44.5631053',
        'longitude' => '38.0790184',
    ],
    'city203' => [
        'name' => 'Георгиевск',
        'latitude' => '44.1486421',
        'longitude' => '43.4739718',
    ],
    'city204' => [
        'name' => 'Глазов',
        'latitude' => '58.1359111',
        'longitude' => '52.6634998',
    ],
    'city205' => [
        'name' => 'Голицыно',
        'latitude' => '55.6189762',
        'longitude' => '36.9855559',
    ],
    'city206' => [
        'name' => 'Горбатов',
        'latitude' => '56.1307901',
        'longitude' => '43.0626829',
    ],
    'city207' => [
        'name' => 'Горно-Алтайск',
        'latitude' => '51.9582681',
        'longitude' => '85.9602957',
    ],
    'city208' => [
        'name' => 'Горнозаводск',
        'latitude' => '58.3743406',
        'longitude' => '58.3230329',
    ],
    'city209' => [
        'name' => 'Горняк',
        'latitude' => '50.9979032',
        'longitude' => '81.4643059',
    ],
    'city210' => [
        'name' => 'Городец',
        'latitude' => '56.6447459',
        'longitude' => '43.4722975',
    ],
    'city211' => [
        'name' => 'Городище',
        'latitude' => '53.2727888',
        'longitude' => '45.702731',
    ],
    'city212' => [
        'name' => 'Городовиковск',
        'latitude' => '46.0875351',
        'longitude' => '41.9354039',
    ],
    'city213' => [
        'name' => 'Гороховец',
        'latitude' => '56.2021059',
        'longitude' => '42.692517',
    ],
    'city214' => [
        'name' => 'Горячий Ключ',
        'latitude' => '44.6343251',
        'longitude' => '39.1356421',
    ],
    'city215' => [
        'name' => 'Грайворон',
        'latitude' => '50.4862699',
        'longitude' => '35.6662957',
    ],
    'city216' => [
        'name' => 'Гремячинск',
        'latitude' => '58.5625603',
        'longitude' => '57.8520073',
    ],
    'city217' => [
        'name' => 'Грозный',
        'latitude' => '43.3179243',
        'longitude' => '45.6981102',
    ],
    'city218' => [
        'name' => 'Грязи',
        'latitude' => '52.4873931',
        'longitude' => '39.9331785',
    ],
    'city219' => [
        'name' => 'Грязовец',
        'latitude' => '58.8757657',
        'longitude' => '40.248477',
    ],
    'city220' => [
        'name' => 'Губаха',
        'latitude' => '58.837024',
        'longitude' => '57.5544441',
    ],
    'city221' => [
        'name' => 'Губкин',
        'latitude' => '51.2836362',
        'longitude' => '37.5347608',
    ],
    'city222' => [
        'name' => 'Губкинский',
        'latitude' => '64.4456575',
        'longitude' => '76.4714559',
    ],
    'city223' => [
        'name' => 'Гудермес',
        'latitude' => '43.3519164',
        'longitude' => '46.1036052',
    ],
    'city224' => [
        'name' => 'Гуково',
        'latitude' => '48.0449422',
        'longitude' => '39.9484635',
    ],
    'city225' => [
        'name' => 'Гулькевичи',
        'latitude' => '45.3605769',
        'longitude' => '40.6918484',
    ],
    'city226' => [
        'name' => 'Гурьевск',
        'latitude' => '54.7705368',
        'longitude' => '20.6039109',
    ],
    'city227' => [
        'name' => 'Гусев',
        'latitude' => '54.5915477',
        'longitude' => '22.1944114',
    ],
    'city228' => [
        'name' => 'Гусиноозерск',
        'latitude' => '51.2865751',
        'longitude' => '106.5230732',
    ],
    'city229' => [
        'name' => 'Гусь-Хрустальный',
        'latitude' => '55.6198065',
        'longitude' => '40.6578769',
    ],
    'city230' => [
        'name' => 'Давлеканово',
        'latitude' => '54.2227617',
        'longitude' => '55.0313419',
    ],
    'city231' => [
        'name' => 'Дагестанские Огни',
        'latitude' => '42.1151021',
        'longitude' => '48.1939983',
    ],
    'city232' => [
        'name' => 'Далматово',
        'latitude' => '56.2621393',
        'longitude' => '62.9387378',
    ],
    'city233' => [
        'name' => 'Дальнегорск',
        'latitude' => '44.5539909',
        'longitude' => '135.5662536',
    ],
    'city234' => [
        'name' => 'Дальнереченск',
        'latitude' => '45.9307882',
        'longitude' => '133.7316542',
    ],
    'city235' => [
        'name' => 'Данилов',
        'latitude' => '58.1859542',
        'longitude' => '40.1796765',
    ],
    'city236' => [
        'name' => 'Данков',
        'latitude' => '53.25769',
        'longitude' => '39.1457625',
    ],
    'city237' => [
        'name' => 'Дегтярск',
        'latitude' => '56.7048199',
        'longitude' => '60.0792227',
    ],
    'city238' => [
        'name' => 'Дедовск',
        'latitude' => '55.8704718',
        'longitude' => '37.1244724',
    ],
    'city239' => [
        'name' => 'Демидов',
        'latitude' => '55.2682611',
        'longitude' => '31.5062078',
    ],
    'city240' => [
        'name' => 'Дербент',
        'latitude' => '42.058935',
        'longitude' => '48.2908653',
    ],
    'city241' => [
        'name' => 'Десногорск',
        'latitude' => '54.1465117',
        'longitude' => '33.2834063',
    ],
    'city242' => [
        'name' => 'Джанкой',
        'latitude' => '45.7092436',
        'longitude' => '34.388332',
    ],
    'city243' => [
        'name' => 'Дзержинск',
        'latitude' => '56.2376438',
        'longitude' => '43.4599363',
    ],
    'city244' => [
        'name' => 'Дзержинский',
        'latitude' => '55.6241079',
        'longitude' => '37.8440691',
    ],
    'city245' => [
        'name' => 'Дивногорск',
        'latitude' => '55.9577868',
        'longitude' => '92.380085',
    ],
    'city246' => [
        'name' => 'Дигора',
        'latitude' => '43.1567386',
        'longitude' => '44.1551132',
    ],
    'city247' => [
        'name' => 'Димитровград',
        'latitude' => '54.2168446',
        'longitude' => '49.6261645',
    ],
    'city248' => [
        'name' => 'Дмитриев',
        'latitude' => '52.1269291',
        'longitude' => '35.0739504',
    ],
    'city249' => [
        'name' => 'Дмитров',
        'latitude' => '56.3477176',
        'longitude' => '37.5267184',
    ],
    'city250' => [
        'name' => 'Дмитровск',
        'latitude' => '52.5053481',
        'longitude' => '35.141535',
    ],
    'city251' => [
        'name' => 'Дно',
        'latitude' => '57.8269802',
        'longitude' => '29.9629569',
    ],
    'city252' => [
        'name' => 'Добрянка',
        'latitude' => '58.4696353',
        'longitude' => '56.4131294',
    ],
    'city253' => [
        'name' => 'Долгопрудный',
        'latitude' => '55.9384901',
        'longitude' => '37.5100527',
    ],
    'city254' => [
        'name' => 'Долинск',
        'latitude' => '47.3255903',
        'longitude' => '142.7945985',
    ],
    'city255' => [
        'name' => 'Домодедово',
        'latitude' => '55.4363901',
        'longitude' => '37.7666263',
    ],
    'city256' => [
        'name' => 'Донецк',
        'latitude' => '48.3350928',
        'longitude' => '39.9460654',
    ],
    'city257' => [
        'name' => 'Донской',
        'latitude' => '53.9679582',
        'longitude' => '38.3372104',
    ],
    'city258' => [
        'name' => 'Дорогобуж',
        'latitude' => '54.9137794',
        'longitude' => '33.3024596',
    ],
    'city259' => [
        'name' => 'Дрезна',
        'latitude' => '55.7442991',
        'longitude' => '38.8499228',
    ],
    'city260' => [
        'name' => 'Дубна',
        'latitude' => '56.7417949',
        'longitude' => '37.1757163',
    ],
    'city261' => [
        'name' => 'Дубовка',
        'latitude' => '49.0555342',
        'longitude' => '44.8270813',
    ],
    'city262' => [
        'name' => 'Дудинка',
        'latitude' => '69.4031339',
        'longitude' => '86.1908135',
    ],
    'city263' => [
        'name' => 'Духовщина',
        'latitude' => '55.1950509',
        'longitude' => '32.4012351',
    ],
    'city264' => [
        'name' => 'Дюртюли',
        'latitude' => '55.4848047',
        'longitude' => '54.8524875',
    ],
    'city265' => [
        'name' => 'Дятьково',
        'latitude' => '53.5958283',
        'longitude' => '34.355092',
    ],
    'city266' => [
        'name' => 'Евпатория',
        'latitude' => '45.1904322',
        'longitude' => '33.3667685',
    ],
    'city267' => [
        'name' => 'Егорьевск',
        'latitude' => '55.3831326',
        'longitude' => '39.0358236',
    ],
    'city268' => [
        'name' => 'Ейск',
        'latitude' => '46.7114611',
        'longitude' => '38.2764915',
    ],
    'city269' => [
        'name' => 'Екатеринбург',
        'latitude' => '56.8386326',
        'longitude' => '60.6054887',
    ],
    'city270' => [
        'name' => 'Елабуга',
        'latitude' => '55.7566727',
        'longitude' => '52.0544438',
    ],
    'city271' => [
        'name' => 'Елец',
        'latitude' => '52.6151738',
        'longitude' => '38.5289121',
    ],
    'city272' => [
        'name' => 'Елизово',
        'latitude' => '53.1829573',
        'longitude' => '158.3882833',
    ],
    'city273' => [
        'name' => 'Ельня',
        'latitude' => '54.5836832',
        'longitude' => '33.1749566',
    ],
    'city274' => [
        'name' => 'Еманжелинск',
        'latitude' => '54.7554084',
        'longitude' => '61.3243985',
    ],
    'city275' => [
        'name' => 'Емва',
        'latitude' => '62.5965314',
        'longitude' => '50.8731889',
    ],
    'city276' => [
        'name' => 'Енисейск',
        'latitude' => '58.4485234',
        'longitude' => '92.165237',
    ],
    'city277' => [
        'name' => 'Ермолино',
        'latitude' => '55.1972714',
        'longitude' => '36.5951966',
    ],
    'city278' => [
        'name' => 'Ершов',
        'latitude' => '51.3508407',
        'longitude' => '48.2763313',
    ],
    'city279' => [
        'name' => 'Ессентуки',
        'latitude' => '44.044461',
        'longitude' => '42.8589078',
    ],
    'city280' => [
        'name' => 'Ефремов',
        'latitude' => '53.1465725',
        'longitude' => '38.0922412',
    ],
    'city281' => [
        'name' => 'Железноводск',
        'latitude' => '44.1320689',
        'longitude' => '43.0306475',
    ],
    'city282' => [
        'name' => 'Железногорск',
        'latitude' => '56.2529346',
        'longitude' => '93.532167',
    ],
    'city283' => [
        'name' => 'Железногорск-Илимский',
        'latitude' => '56.5847382',
        'longitude' => '104.1141747',
    ],
    'city284' => [
        'name' => 'Жердевка',
        'latitude' => '51.8421783',
        'longitude' => '41.4617407',
    ],
    'city285' => [
        'name' => 'Жигулевск',
        'latitude' => '53.4011545',
        'longitude' => '49.494529',
    ],
    'city286' => [
        'name' => 'Жиздра',
        'latitude' => '53.7522384',
        'longitude' => '34.7386719',
    ],
    'city287' => [
        'name' => 'Жирновск',
        'latitude' => '50.9767561',
        'longitude' => '44.7857694',
    ],
    'city288' => [
        'name' => 'Жуков',
        'latitude' => '55.0301386',
        'longitude' => '36.7393279',
    ],
    'city289' => [
        'name' => 'Жуковка',
        'latitude' => '53.5341219',
        'longitude' => '33.7302166',
    ],
    'city290' => [
        'name' => 'Жуковский',
        'latitude' => '55.5998408',
        'longitude' => '38.1224185',
    ],
    'city291' => [
        'name' => 'Завитинск',
        'latitude' => '50.1064678',
        'longitude' => '129.4392897',
    ],
    'city292' => [
        'name' => 'Заводоуковск',
        'latitude' => '56.5012193',
        'longitude' => '66.5505094',
    ],
    'city293' => [
        'name' => 'Заволжск',
        'latitude' => '57.4916546',
        'longitude' => '42.1374455',
    ],
    'city294' => [
        'name' => 'Заволжье',
        'latitude' => '56.6404237',
        'longitude' => '43.3871565',
    ],
    'city295' => [
        'name' => 'Задонск',
        'latitude' => '52.4004611',
        'longitude' => '38.9205772',
    ],
    'city296' => [
        'name' => 'Заинск',
        'latitude' => '55.2988854',
        'longitude' => '52.0063634',
    ],
    'city297' => [
        'name' => 'Закаменск',
        'latitude' => '50.3726774',
        'longitude' => '103.2867452',
    ],
    'city298' => [
        'name' => 'Заозерный',
        'latitude' => '55.9617268',
        'longitude' => '94.7091037',
    ],
    'city299' => [
        'name' => 'Заозерск',
        'latitude' => '69.4003895',
        'longitude' => '32.4502225',
    ],
    'city300' => [
        'name' => 'Западная Двина',
        'latitude' => '56.2568002',
        'longitude' => '32.0805972',
    ],
    'city301' => [
        'name' => 'Заполярный',
        'latitude' => '69.413232',
        'longitude' => '30.7985332',
    ],
    'city302' => [
        'name' => 'Зарайск',
        'latitude' => '54.7625993',
        'longitude' => '38.8851485',
    ],
    'city303' => [
        'name' => 'Заречный',
        'latitude' => '53.1961009',
        'longitude' => '45.1691502',
    ],
    'city304' => [
        'name' => 'Заринск',
        'latitude' => '53.7063495',
        'longitude' => '84.9314703',
    ],
    'city305' => [
        'name' => 'Звенигово',
        'latitude' => '55.9739374',
        'longitude' => '48.0170276',
    ],
    'city306' => [
        'name' => 'Звенигород',
        'latitude' => '55.7296168',
        'longitude' => '36.8552843',
    ],
    'city307' => [
        'name' => 'Зверево',
        'latitude' => '48.043451',
        'longitude' => '40.1264948',
    ],
    'city308' => [
        'name' => 'Зеленогорск',
        'latitude' => '56.1133001',
        'longitude' => '94.5888736',
    ],
    'city309' => [
        'name' => 'Зеленоградск',
        'latitude' => '54.9600226',
        'longitude' => '20.4753274',
    ],
    'city310' => [
        'name' => 'Зеленодольск',
        'latitude' => '55.8466751',
        'longitude' => '48.5010882',
    ],
    'city311' => [
        'name' => 'Зеленокумск',
        'latitude' => '44.403359',
        'longitude' => '43.8841326',
    ],
    'city312' => [
        'name' => 'Зерноград',
        'latitude' => '46.8494991',
        'longitude' => '40.312765',
    ],
    'city313' => [
        'name' => 'Зея',
        'latitude' => '53.7339151',
        'longitude' => '127.2658079',
    ],
    'city314' => [
        'name' => 'Зима',
        'latitude' => '53.9206865',
        'longitude' => '102.0492066',
    ],
    'city315' => [
        'name' => 'Златоуст',
        'latitude' => '55.1715695',
        'longitude' => '59.6726264',
    ],
    'city316' => [
        'name' => 'Злынка',
        'latitude' => '52.4265906',
        'longitude' => '31.7360386',
    ],
    'city317' => [
        'name' => 'Змеиногорск',
        'latitude' => '51.1580235',
        'longitude' => '82.1872476',
    ],
    'city318' => [
        'name' => 'Знаменск',
        'latitude' => '48.5865618',
        'longitude' => '45.7367908',
    ],
    'city319' => [
        'name' => 'Зубцов',
        'latitude' => '56.1760709',
        'longitude' => '34.5825504',
    ],
    'city320' => [
        'name' => 'Зуевка',
        'latitude' => '58.4031674',
        'longitude' => '51.1330787',
    ],
    'city321' => [
        'name' => 'Ивангород',
        'latitude' => '59.3765845',
        'longitude' => '28.2230504',
    ],
    'city322' => [
        'name' => 'Иваново',
        'latitude' => '56.9994677',
        'longitude' => '40.9728231',
    ],
    'city323' => [
        'name' => 'Ивантеевка',
        'latitude' => '55.9742303',
        'longitude' => '37.9208755',
    ],
    'city324' => [
        'name' => 'Ивдель',
        'latitude' => '60.6944353',
        'longitude' => '60.4244661',
    ],
    'city325' => [
        'name' => 'Игарка',
        'latitude' => '67.4667947',
        'longitude' => '86.5814287',
    ],
    'city326' => [
        'name' => 'Ижевск',
        'latitude' => '56.8527444',
        'longitude' => '53.2113961',
    ],
    'city327' => [
        'name' => 'Избербаш',
        'latitude' => '42.565098',
        'longitude' => '47.871002',
    ],
    'city328' => [
        'name' => 'Изобильный',
        'latitude' => '45.3684342',
        'longitude' => '41.7086448',
    ],
    'city329' => [
        'name' => 'Иланский',
        'latitude' => '56.2374163',
        'longitude' => '96.0672656',
    ],
    'city330' => [
        'name' => 'Инза',
        'latitude' => '53.8550467',
        'longitude' => '46.3532786',
    ],
    'city331' => [
        'name' => 'Инкерман',
        'latitude' => '44.6135153',
        'longitude' => '33.6100739',
    ],
    'city332' => [
        'name' => 'Иннополис',
        'latitude' => '55.7521544',
        'longitude' => '48.7446161',
    ],
    'city333' => [
        'name' => 'Инсар',
        'latitude' => '53.8770384',
        'longitude' => '44.3696866',
    ],
    'city334' => [
        'name' => 'Инта',
        'latitude' => '66.0368196',
        'longitude' => '60.1154612',
    ],
    'city335' => [
        'name' => 'Ипатово',
        'latitude' => '45.7181897',
        'longitude' => '42.8969695',
    ],
    'city336' => [
        'name' => 'Ирбит',
        'latitude' => '57.6838406',
        'longitude' => '63.0576639',
    ],
    'city337' => [
        'name' => 'Иркутск',
        'latitude' => '52.2863513',
        'longitude' => '104.280655',
    ],
    'city338' => [
        'name' => 'Исилькуль',
        'latitude' => '54.9096156',
        'longitude' => '71.2816107',
    ],
    'city339' => [
        'name' => 'Искитим',
        'latitude' => '54.6266869',
        'longitude' => '83.2951444',
    ],
    'city340' => [
        'name' => 'Истра',
        'latitude' => '55.9061087',
        'longitude' => '36.8600854',
    ],
    'city341' => [
        'name' => 'Ишим',
        'latitude' => '56.0952037',
        'longitude' => '69.4643292',
    ],
    'city342' => [
        'name' => 'Ишимбай',
        'latitude' => '53.4546314',
        'longitude' => '56.043874',
    ],
    'city343' => [
        'name' => 'Йошкар-Ола',
        'latitude' => '56.6343763',
        'longitude' => '47.8998445',
    ],
    'city344' => [
        'name' => 'Кадников',
        'latitude' => '59.5037947',
        'longitude' => '40.3440473',
    ],
    'city345' => [
        'name' => 'Казань',
        'latitude' => '55.7943877',
        'longitude' => '49.1115312',
    ],
    'city346' => [
        'name' => 'Калач',
        'latitude' => '50.4241213',
        'longitude' => '41.0162858',
    ],
    'city347' => [
        'name' => 'Калачинск',
        'latitude' => '55.0598547',
        'longitude' => '74.5655075',
    ],
    'city348' => [
        'name' => 'Калач-на-Дону',
        'latitude' => '48.6887569',
        'longitude' => '43.5306866',
    ],
    'city349' => [
        'name' => 'Калининград',
        'latitude' => '54.7073218',
        'longitude' => '20.5072458',
    ],
    'city350' => [
        'name' => 'Калининск',
        'latitude' => '51.4992917',
        'longitude' => '44.4710177',
    ],
    'city351' => [
        'name' => 'Калтан',
        'latitude' => '53.5210461',
        'longitude' => '87.2772143',
    ],
    'city352' => [
        'name' => 'Калуга',
        'latitude' => '54.5060439',
        'longitude' => '36.2515933',
    ],
    'city353' => [
        'name' => 'Калязин',
        'latitude' => '57.2579471',
        'longitude' => '37.7821253',
    ],
    'city354' => [
        'name' => 'Камбарка',
        'latitude' => '56.2659745',
        'longitude' => '54.1934153',
    ],
    'city355' => [
        'name' => 'Каменка',
        'latitude' => '53.1855474',
        'longitude' => '44.0468501',
    ],
    'city356' => [
        'name' => 'Каменногорск',
        'latitude' => '60.9508768',
        'longitude' => '29.1308061',
    ],
    'city357' => [
        'name' => 'Каменск-Уральский',
        'latitude' => '56.4149095',
        'longitude' => '61.9189837',
    ],
    'city358' => [
        'name' => 'Каменск-Шахтинский',
        'latitude' => '48.3204412',
        'longitude' => '40.268874',
    ],
    'city359' => [
        'name' => 'Камень-на-Оби',
        'latitude' => '53.7915454',
        'longitude' => '81.3545173',
    ],
    'city360' => [
        'name' => 'Камешково',
        'latitude' => '56.3488712',
        'longitude' => '40.9955682',
    ],
    'city361' => [
        'name' => 'Камызяк',
        'latitude' => '46.1105429',
        'longitude' => '48.0732724',
    ],
    'city362' => [
        'name' => 'Камышин',
        'latitude' => '50.0651261',
        'longitude' => '45.3843816',
    ],
    'city363' => [
        'name' => 'Камышлов',
        'latitude' => '56.8465469',
        'longitude' => '62.7120432',
    ],
    'city364' => [
        'name' => 'Канаш',
        'latitude' => '55.5069543',
        'longitude' => '47.4917734',
    ],
    'city365' => [
        'name' => 'Кандалакша',
        'latitude' => '67.1567298',
        'longitude' => '32.4142303',
    ],
    'city366' => [
        'name' => 'Канск',
        'latitude' => '56.2049776',
        'longitude' => '95.7051246',
    ],
    'city367' => [
        'name' => 'Карабаново',
        'latitude' => '56.3133447',
        'longitude' => '38.7034267',
    ],
    'city368' => [
        'name' => 'Карабаш',
        'latitude' => '55.4852076',
        'longitude' => '60.2358959',
    ],
    'city369' => [
        'name' => 'Карабулак',
        'latitude' => '43.3054762',
        'longitude' => '44.9094521',
    ],
    'city370' => [
        'name' => 'Карасук',
        'latitude' => '53.7343772',
        'longitude' => '78.042457',
    ],
    'city371' => [
        'name' => 'Карачаевск',
        'latitude' => '43.773197',
        'longitude' => '41.9143726',
    ],
    'city372' => [
        'name' => 'Карачев',
        'latitude' => '53.1297194',
        'longitude' => '34.9887859',
    ],
    'city373' => [
        'name' => 'Каргат',
        'latitude' => '55.1943829',
        'longitude' => '80.2831324',
    ],
    'city374' => [
        'name' => 'Каргополь',
        'latitude' => '61.5008762',
        'longitude' => '38.9636415',
    ],
    'city375' => [
        'name' => 'Карпинск',
        'latitude' => '59.7664444',
        'longitude' => '60.0011798',
    ],
    'city376' => [
        'name' => 'Карталы',
        'latitude' => '53.0536101',
        'longitude' => '60.647712',
    ],
    'city377' => [
        'name' => 'Касимов',
        'latitude' => '54.9373788',
        'longitude' => '41.3912912',
    ],
    'city378' => [
        'name' => 'Касли',
        'latitude' => '55.8868045',
        'longitude' => '60.7422529',
    ],
    'city379' => [
        'name' => 'Каспийск',
        'latitude' => '42.8916599',
        'longitude' => '47.6366674',
    ],
    'city380' => [
        'name' => 'Катав-Ивановск',
        'latitude' => '54.7520187',
        'longitude' => '58.1983706',
    ],
    'city381' => [
        'name' => 'Катайск',
        'latitude' => '56.2908118',
        'longitude' => '62.5800669',
    ],
    'city382' => [
        'name' => 'Качканар',
        'latitude' => '58.7051759',
        'longitude' => '59.4840198',
    ],
    'city383' => [
        'name' => 'Кашин',
        'latitude' => '57.3600486',
        'longitude' => '37.6118674',
    ],
    'city384' => [
        'name' => 'Кашира',
        'latitude' => '54.8534263',
        'longitude' => '38.1903818',
    ],
    'city385' => [
        'name' => 'Кедровый',
        'latitude' => '57.5618465',
        'longitude' => '79.5678914',
    ],
    'city386' => [
        'name' => 'Кемерово',
        'latitude' => '55.3909721',
        'longitude' => '86.0467864',
    ],
    'city387' => [
        'name' => 'Кемь',
        'latitude' => '64.9543657',
        'longitude' => '34.5948547',
    ],
    'city388' => [
        'name' => 'Керчь',
        'latitude' => '45.3561128',
        'longitude' => '36.4674285',
    ],
    'city389' => [
        'name' => 'Кизел',
        'latitude' => '59.0511764',
        'longitude' => '57.6471214',
    ],
    'city390' => [
        'name' => 'Кизилюрт',
        'latitude' => '43.2039094',
        'longitude' => '46.8729311',
    ],
    'city391' => [
        'name' => 'Кизляр',
        'latitude' => '43.8483915',
        'longitude' => '46.7232828',
    ],
    'city392' => [
        'name' => 'Кимовск',
        'latitude' => '53.9698378',
        'longitude' => '38.5380267',
    ],
    'city393' => [
        'name' => 'Кимры',
        'latitude' => '56.873359',
        'longitude' => '37.3557064',
    ],
    'city394' => [
        'name' => 'Кингисепп',
        'latitude' => '59.3739407',
        'longitude' => '28.6112981',
    ],
    'city395' => [
        'name' => 'Кинель',
        'latitude' => '53.2209985',
        'longitude' => '50.6343039',
    ],
    'city396' => [
        'name' => 'Кинешма',
        'latitude' => '57.4425441',
        'longitude' => '42.1690039',
    ],
    'city397' => [
        'name' => 'Киреевск',
        'latitude' => '53.9321173',
        'longitude' => '37.9220791',
    ],
    'city398' => [
        'name' => 'Киренск',
        'latitude' => '57.7757126',
        'longitude' => '108.1107766',
    ],
    'city399' => [
        'name' => 'Киржач',
        'latitude' => '56.1485263',
        'longitude' => '38.8635035',
    ],
    'city400' => [
        'name' => 'Кириллов',
        'latitude' => '59.8590353',
        'longitude' => '38.3749854',
    ],
    'city401' => [
        'name' => 'Кириши',
        'latitude' => '59.4742626',
        'longitude' => '32.0625536',
    ],
    'city402' => [
        'name' => 'Киров',
        'latitude' => '54.0790823',
        'longitude' => '34.3077508',
    ],
    'city403' => [
        'name' => 'Кировград',
        'latitude' => '57.4298451',
        'longitude' => '60.0623588',
    ],
    'city404' => [
        'name' => 'Кирово-Чепецк',
        'latitude' => '58.5559921',
        'longitude' => '50.0317608',
    ],
    'city405' => [
        'name' => 'Кировск',
        'latitude' => '59.875371',
        'longitude' => '30.9815205',
    ],
    'city406' => [
        'name' => 'Кирс',
        'latitude' => '59.3400586',
        'longitude' => '52.2415895',
    ],
    'city407' => [
        'name' => 'Кирсанов',
        'latitude' => '52.650594',
        'longitude' => '42.7284872',
    ],
    'city408' => [
        'name' => 'Киселевск',
        'latitude' => '54.0060382',
        'longitude' => '86.6367387',
    ],
    'city409' => [
        'name' => 'Кисловодск',
        'latitude' => '43.905235',
        'longitude' => '42.7167187',
    ],
    'city410' => [
        'name' => 'Клин',
        'latitude' => '56.3424886',
        'longitude' => '36.7240912',
    ],
    'city411' => [
        'name' => 'Клинцы',
        'latitude' => '52.7529052',
        'longitude' => '32.2339161',
    ],
    'city412' => [
        'name' => 'Княгинино',
        'latitude' => '55.8205157',
        'longitude' => '45.0322947',
    ],
    'city413' => [
        'name' => 'Ковдор',
        'latitude' => '67.5661466',
        'longitude' => '30.4742082',
    ],
    'city414' => [
        'name' => 'Ковров',
        'latitude' => '56.3553895',
        'longitude' => '41.3169568',
    ],
    'city415' => [
        'name' => 'Ковылкино',
        'latitude' => '54.0391464',
        'longitude' => '43.9191229',
    ],
    'city416' => [
        'name' => 'Когалым',
        'latitude' => '62.2638914',
        'longitude' => '74.4828687',
    ],
    'city417' => [
        'name' => 'Кодинск',
        'latitude' => '58.6033961',
        'longitude' => '99.1797563',
    ],
    'city418' => [
        'name' => 'Козельск',
        'latitude' => '54.0348417',
        'longitude' => '35.7807136',
    ],
    'city419' => [
        'name' => 'Козловка',
        'latitude' => '55.8406526',
        'longitude' => '48.2579372',
    ],
    'city420' => [
        'name' => 'Козьмодемьянск',
        'latitude' => '56.333346',
        'longitude' => '46.5466282',
    ],
    'city421' => [
        'name' => 'Кола',
        'latitude' => '68.8785079',
        'longitude' => '33.0262014',
    ],
    'city422' => [
        'name' => 'Кологрив',
        'latitude' => '58.826988',
        'longitude' => '44.3185323',
    ],
    'city423' => [
        'name' => 'Коломна',
        'latitude' => '55.1027797',
        'longitude' => '38.7531734',
    ],
    'city424' => [
        'name' => 'Колпашево',
        'latitude' => '58.3114716',
        'longitude' => '82.9027528',
    ],
    'city425' => [
        'name' => 'Кольчугино',
        'latitude' => '56.3327616',
        'longitude' => '39.391201',
    ],
    'city426' => [
        'name' => 'Коммунар',
        'latitude' => '59.6215929',
        'longitude' => '30.393466',
    ],
    'city427' => [
        'name' => 'Комсомольск',
        'latitude' => '57.0273907',
        'longitude' => '40.3775952',
    ],
    'city428' => [
        'name' => 'Комсомольск-на-Амуре',
        'latitude' => '50.550011',
        'longitude' => '137.0079286',
    ],
    'city429' => [
        'name' => 'Конаково',
        'latitude' => '56.7275533',
        'longitude' => '36.8011699',
    ],
    'city430' => [
        'name' => 'Кондопога',
        'latitude' => '62.2059866',
        'longitude' => '34.2681778',
    ],
    'city431' => [
        'name' => 'Кондрово',
        'latitude' => '54.796051',
        'longitude' => '35.9276099',
    ],
    'city432' => [
        'name' => 'Константиновск',
        'latitude' => '47.5773456',
        'longitude' => '41.0967362',
    ],
    'city433' => [
        'name' => 'Копейск',
        'latitude' => '55.1167545',
        'longitude' => '61.6180809',
    ],
    'city434' => [
        'name' => 'Кораблино',
        'latitude' => '53.9245422',
        'longitude' => '40.0227867',
    ],
    'city435' => [
        'name' => 'Кореновск',
        'latitude' => '45.4640868',
        'longitude' => '39.4590178',
    ],
    'city436' => [
        'name' => 'Коркино',
        'latitude' => '54.8903023',
        'longitude' => '61.4034541',
    ],
    'city437' => [
        'name' => 'Королев',
        'latitude' => '55.9162558',
        'longitude' => '37.8545224',
    ],
    'city438' => [
        'name' => 'Короча',
        'latitude' => '50.8130123',
        'longitude' => '37.1896543',
    ],
    'city439' => [
        'name' => 'Корсаков',
        'latitude' => '46.6323995',
        'longitude' => '142.7994094',
    ],
    'city440' => [
        'name' => 'Коряжма',
        'latitude' => '61.2885993',
        'longitude' => '47.1002315',
    ],
    'city441' => [
        'name' => 'Костерево',
        'latitude' => '55.9336424',
        'longitude' => '39.624822',
    ],
    'city442' => [
        'name' => 'Костомукша',
        'latitude' => '64.5889946',
        'longitude' => '30.6015567',
    ],
    'city443' => [
        'name' => 'Кострома',
        'latitude' => '57.8029445',
        'longitude' => '40.9907282',
    ],
    'city444' => [
        'name' => 'Котельники',
        'latitude' => '55.659898',
        'longitude' => '37.8632865',
    ],
    'city445' => [
        'name' => 'Котельниково',
        'latitude' => '47.6310808',
        'longitude' => '43.1331198',
    ],
    'city446' => [
        'name' => 'Котельнич',
        'latitude' => '58.3035238',
        'longitude' => '48.3474288',
    ],
    'city447' => [
        'name' => 'Котлас',
        'latitude' => '61.2529842',
        'longitude' => '46.6331915',
    ],
    'city448' => [
        'name' => 'Котово',
        'latitude' => '50.3205433',
        'longitude' => '44.8031864',
    ],
    'city449' => [
        'name' => 'Котовск',
        'latitude' => '52.592393',
        'longitude' => '41.5102486',
    ],
    'city450' => [
        'name' => 'Кохма',
        'latitude' => '56.9325151',
        'longitude' => '41.0933071',
    ],
    'city451' => [
        'name' => 'Красавино',
        'latitude' => '60.9613991',
        'longitude' => '46.481465',
    ],
    'city452' => [
        'name' => 'Красноармейск',
        'latitude' => '51.0268595',
        'longitude' => '45.7011086',
    ],
    'city453' => [
        'name' => 'Красновишерск',
        'latitude' => '60.3902242',
        'longitude' => '57.0537244',
    ],
    'city454' => [
        'name' => 'Красногорск',
        'latitude' => '55.8318475',
        'longitude' => '37.32942',
    ],
    'city455' => [
        'name' => 'Краснодар',
        'latitude' => '45.040235',
        'longitude' => '38.9760801',
    ],
    'city456' => [
        'name' => 'Краснозаводск',
        'latitude' => '56.4408723',
        'longitude' => '38.2320671',
    ],
    'city457' => [
        'name' => 'Краснознаменск',
        'latitude' => '54.9452612',
        'longitude' => '22.4928511',
    ],
    'city458' => [
        'name' => 'Краснокаменск',
        'latitude' => '50.092858',
        'longitude' => '118.0323407',
    ],
    'city459' => [
        'name' => 'Краснокамск',
        'latitude' => '58.0820946',
        'longitude' => '55.7479797',
    ],
    'city460' => [
        'name' => 'Красноперекопск',
        'latitude' => '45.9537956',
        'longitude' => '33.7921523',
    ],
    'city461' => [
        'name' => 'Краснослободск',
        'latitude' => '48.7068777',
        'longitude' => '44.5631799',
    ],
    'city462' => [
        'name' => 'Краснотурьинск',
        'latitude' => '59.7636934',
        'longitude' => '60.1934451',
    ],
    'city463' => [
        'name' => 'Красноуральск',
        'latitude' => '58.3486334',
        'longitude' => '60.0409011',
    ],
    'city464' => [
        'name' => 'Красноуфимск',
        'latitude' => '56.6122864',
        'longitude' => '57.7636958',
    ],
    'city465' => [
        'name' => 'Красноярск',
        'latitude' => '56.009466',
        'longitude' => '92.8524162',
    ],
    'city466' => [
        'name' => 'Красный Кут',
        'latitude' => '50.9596867',
        'longitude' => '46.9712472',
    ],
    'city467' => [
        'name' => 'Красный Сулин',
        'latitude' => '47.8830826',
        'longitude' => '40.0781385',
    ],
    'city468' => [
        'name' => 'Красный Холм',
        'latitude' => '58.0570193',
        'longitude' => '37.1125975',
    ],
    'city469' => [
        'name' => 'Кременки',
        'latitude' => '54.8863306',
        'longitude' => '37.116878',
    ],
    'city470' => [
        'name' => 'Кропоткин',
        'latitude' => '45.4332464',
        'longitude' => '40.5727852',
    ],
    'city471' => [
        'name' => 'Крымск',
        'latitude' => '44.9344108',
        'longitude' => '37.9855314',
    ],
    'city472' => [
        'name' => 'Кстово',
        'latitude' => '56.1433353',
        'longitude' => '44.1665081',
    ],
    'city473' => [
        'name' => 'Кубинка',
        'latitude' => '55.5755679',
        'longitude' => '36.6952487',
    ],
    'city474' => [
        'name' => 'Кувандык',
        'latitude' => '51.4784845',
        'longitude' => '57.3612029',
    ],
    'city475' => [
        'name' => 'Кувшиново',
        'latitude' => '57.0263733',
        'longitude' => '34.1676435',
    ],
    'city476' => [
        'name' => 'Кудымкар',
        'latitude' => '59.0168605',
        'longitude' => '54.6573459',
    ],
    'city477' => [
        'name' => 'Кузнецк',
        'latitude' => '53.1131686',
        'longitude' => '46.6052497',
    ],
    'city478' => [
        'name' => 'Куйбышев',
        'latitude' => '55.4684104',
        'longitude' => '78.3241042',
    ],
    'city479' => [
        'name' => 'Кулебаки',
        'latitude' => '55.429716',
        'longitude' => '42.512483',
    ],
    'city480' => [
        'name' => 'Кумертау',
        'latitude' => '52.7565537',
        'longitude' => '55.7969915',
    ],
    'city481' => [
        'name' => 'Кунгур',
        'latitude' => '57.4283217',
        'longitude' => '56.9437787',
    ],
    'city482' => [
        'name' => 'Купино',
        'latitude' => '54.3660317',
        'longitude' => '77.2972969',
    ],
    'city483' => [
        'name' => 'Курган',
        'latitude' => '55.4443448',
        'longitude' => '65.3161339',
    ],
    'city484' => [
        'name' => 'Курганинск',
        'latitude' => '44.8876442',
        'longitude' => '40.5913858',
    ],
    'city485' => [
        'name' => 'Курильск',
        'latitude' => '45.2271915',
        'longitude' => '147.8796713',
    ],
    'city486' => [
        'name' => 'Курлово',
        'latitude' => '55.4525994',
        'longitude' => '40.6124362',
    ],
    'city487' => [
        'name' => 'Куровское',
        'latitude' => '55.5791491',
        'longitude' => '38.9208543',
    ],
    'city488' => [
        'name' => 'Курск',
        'latitude' => '51.7303391',
        'longitude' => '36.1926448',
    ],
    'city489' => [
        'name' => 'Куртамыш',
        'latitude' => '54.9368491',
        'longitude' => '64.4203009',
    ],
    'city490' => [
        'name' => 'Курчатов',
        'latitude' => '51.6605475',
        'longitude' => '35.6571711',
    ],
    'city491' => [
        'name' => 'Куса',
        'latitude' => '55.3385156',
        'longitude' => '59.4386474',
    ],
    'city492' => [
        'name' => 'Кушва',
        'latitude' => '58.2825406',
        'longitude' => '59.7646113',
    ],
    'city493' => [
        'name' => 'Кызыл',
        'latitude' => '51.7191542',
        'longitude' => '94.4377234',
    ],
    'city494' => [
        'name' => 'Кыштым',
        'latitude' => '55.7060048',
        'longitude' => '60.5563271',
    ],
    'city495' => [
        'name' => 'Кяхта',
        'latitude' => '50.3466291',
        'longitude' => '106.4534938',
    ],
    'city496' => [
        'name' => 'Лабинск',
        'latitude' => '44.6353153',
        'longitude' => '40.724385',
    ],
    'city497' => [
        'name' => 'Лабытнанги',
        'latitude' => '66.6592376',
        'longitude' => '66.3882628',
    ],
    'city498' => [
        'name' => 'Лагань',
        'latitude' => '45.3929617',
        'longitude' => '47.3432943',
    ],
    'city499' => [
        'name' => 'Ладушкин',
        'latitude' => '54.5693538',
        'longitude' => '20.1691909',
    ],
    'city500' => [
        'name' => 'Лаишево',
        'latitude' => '55.4042646',
        'longitude' => '49.5498201',
    ],
    'city501' => [
        'name' => 'Лакинск',
        'latitude' => '56.0180614',
        'longitude' => '39.9564706',
    ],
    'city502' => [
        'name' => 'Лангепас',
        'latitude' => '61.2536667',
        'longitude' => '75.1807905',
    ],
    'city503' => [
        'name' => 'Лахденпохья',
        'latitude' => '61.5189466',
        'longitude' => '30.199592',
    ],
    'city504' => [
        'name' => 'Лебедянь',
        'latitude' => '53.0156678',
        'longitude' => '39.143498',
    ],
    'city505' => [
        'name' => 'Лениногорск',
        'latitude' => '54.5966917',
        'longitude' => '52.4432118',
    ],
    'city506' => [
        'name' => 'Ленинск',
        'latitude' => '48.6936234',
        'longitude' => '45.1992835',
    ],
    'city507' => [
        'name' => 'Ленинск-Кузнецкий',
        'latitude' => '54.6674092',
        'longitude' => '86.1796724',
    ],
    'city508' => [
        'name' => 'Ленск',
        'latitude' => '60.7276036',
        'longitude' => '114.9549103',
    ],
    'city509' => [
        'name' => 'Лермонтов',
        'latitude' => '44.1052526',
        'longitude' => '42.9731433',
    ],
    'city510' => [
        'name' => 'Лесной',
        'latitude' => '58.634981',
        'longitude' => '59.7980528',
    ],
    'city511' => [
        'name' => 'Лесозаводск',
        'latitude' => '45.4780192',
        'longitude' => '133.4185501',
    ],
    'city512' => [
        'name' => 'Лесосибирск',
        'latitude' => '58.2218201',
        'longitude' => '92.5036986',
    ],
    'city513' => [
        'name' => 'Ливны',
        'latitude' => '52.4285122',
        'longitude' => '37.603944',
    ],
    'city514' => [
        'name' => 'Ликино-Дулево',
        'latitude' => '55.7078531',
        'longitude' => '38.9577103',
    ],
    'city515' => [
        'name' => 'Липецк',
        'latitude' => '52.6103027',
        'longitude' => '39.5946266',
    ],
    'city516' => [
        'name' => 'Липки',
        'latitude' => '53.9418109',
        'longitude' => '37.7019452',
    ],
    'city517' => [
        'name' => 'Лиски',
        'latitude' => '50.9944734',
        'longitude' => '39.518302',
    ],
    'city518' => [
        'name' => 'Лихославль',
        'latitude' => '57.122256',
        'longitude' => '35.4667886',
    ],
    'city519' => [
        'name' => 'Лобня',
        'latitude' => '56.0328745',
        'longitude' => '37.4614671',
    ],
    'city520' => [
        'name' => 'Лодейное Поле',
        'latitude' => '60.7320564',
        'longitude' => '33.5522225',
    ],
    'city521' => [
        'name' => 'Лосино-Петровский',
        'latitude' => '55.8714441',
        'longitude' => '38.2005377',
    ],
    'city522' => [
        'name' => 'Луга',
        'latitude' => '58.7373818',
        'longitude' => '29.8466657',
    ],
    'city523' => [
        'name' => 'Луза',
        'latitude' => '60.6290781',
        'longitude' => '47.2612069',
    ],
    'city524' => [
        'name' => 'Лукоянов',
        'latitude' => '55.0327349',
        'longitude' => '44.4933829',
    ],
    'city525' => [
        'name' => 'Луховицы',
        'latitude' => '54.9651617',
        'longitude' => '39.0261346',
    ],
    'city526' => [
        'name' => 'Лысково',
        'latitude' => '56.0262298',
        'longitude' => '45.0356702',
    ],
    'city527' => [
        'name' => 'Лысьва',
        'latitude' => '58.0995987',
        'longitude' => '57.8085728',
    ],
    'city528' => [
        'name' => 'Лыткарино',
        'latitude' => '55.5778065',
        'longitude' => '37.9034952',
    ],
    'city529' => [
        'name' => 'Льгов',
        'latitude' => '51.6596935',
        'longitude' => '35.2611592',
    ],
    'city530' => [
        'name' => 'Любань',
        'latitude' => '59.3492573',
        'longitude' => '31.2485276',
    ],
    'city531' => [
        'name' => 'Люберцы',
        'latitude' => '55.700416',
        'longitude' => '37.9606496',
    ],
    'city532' => [
        'name' => 'Любим',
        'latitude' => '58.3619868',
        'longitude' => '40.6869581',
    ],
    'city533' => [
        'name' => 'Людиново',
        'latitude' => '53.8701406',
        'longitude' => '34.4385498',
    ],
    'city534' => [
        'name' => 'Лянтор',
        'latitude' => '61.6391639',
        'longitude' => '72.1793828',
    ],
    'city535' => [
        'name' => 'Магадан',
        'latitude' => '59.5681763',
        'longitude' => '150.8085289',
    ],
    'city536' => [
        'name' => 'Магас',
        'latitude' => '43.1686967',
        'longitude' => '44.8130849',
    ],
    'city537' => [
        'name' => 'Магнитогорск',
        'latitude' => '53.4071891',
        'longitude' => '58.9791432',
    ],
    'city538' => [
        'name' => 'Майкоп',
        'latitude' => '44.6098268',
        'longitude' => '40.1006527',
    ],
    'city539' => [
        'name' => 'Майский',
        'latitude' => '43.6281779',
        'longitude' => '44.0516663',
    ],
    'city540' => [
        'name' => 'Макаров',
        'latitude' => '48.6236287',
        'longitude' => '142.7803508',
    ],
    'city541' => [
        'name' => 'Макарьев',
        'latitude' => '57.8808916',
        'longitude' => '43.8014428',
    ],
    'city542' => [
        'name' => 'Макушино',
        'latitude' => '55.2154025',
        'longitude' => '67.2452558',
    ],
    'city543' => [
        'name' => 'Малая Вишера',
        'latitude' => '58.8458076',
        'longitude' => '32.2247984',
    ],
    'city544' => [
        'name' => 'Малгобек',
        'latitude' => '43.5097009',
        'longitude' => '44.5901517',
    ],
    'city545' => [
        'name' => 'Малмыж',
        'latitude' => '56.5243722',
        'longitude' => '50.6782757',
    ],
    'city546' => [
        'name' => 'Малоархангельск',
        'latitude' => '52.4001151',
        'longitude' => '36.5037931',
    ],
    'city547' => [
        'name' => 'Малоярославец',
        'latitude' => '55.0176756',
        'longitude' => '36.4632122',
    ],
    'city548' => [
        'name' => 'Мамадыш',
        'latitude' => '55.7149876',
        'longitude' => '51.4128614',
    ],
    'city549' => [
        'name' => 'Мамоново',
        'latitude' => '54.4645591',
        'longitude' => '19.9454114',
    ],
    'city550' => [
        'name' => 'Мантурово',
        'latitude' => '58.3264667',
        'longitude' => '44.7575036',
    ],
    'city551' => [
        'name' => 'Мариинск',
        'latitude' => '56.2127836',
        'longitude' => '87.7454392',
    ],
    'city552' => [
        'name' => 'Мариинский Посад',
        'latitude' => '56.111968',
        'longitude' => '47.7142676',
    ],
    'city553' => [
        'name' => 'Маркс',
        'latitude' => '51.7133973',
        'longitude' => '46.7400684',
    ],
    'city554' => [
        'name' => 'Махачкала',
        'latitude' => '42.9848572',
        'longitude' => '47.5046303',
    ],
    'city555' => [
        'name' => 'Мглин',
        'latitude' => '53.0600644',
        'longitude' => '32.8467217',
    ],
    'city556' => [
        'name' => 'Мегион',
        'latitude' => '61.0318946',
        'longitude' => '76.1024772',
    ],
    'city557' => [
        'name' => 'Медвежьегорск',
        'latitude' => '62.9127678',
        'longitude' => '34.4567614',
    ],
    'city558' => [
        'name' => 'Медногорск',
        'latitude' => '51.4039421',
        'longitude' => '57.5832185',
    ],
    'city559' => [
        'name' => 'Медынь',
        'latitude' => '54.9690755',
        'longitude' => '35.887313',
    ],
    'city560' => [
        'name' => 'Межгорье',
        'latitude' => '54.239683',
        'longitude' => '57.96146',
    ],
    'city561' => [
        'name' => 'Междуреченск',
        'latitude' => '53.6865695',
        'longitude' => '88.0703888',
    ],
    'city562' => [
        'name' => 'Мезень',
        'latitude' => '65.8398386',
        'longitude' => '44.2531865',
    ],
    'city563' => [
        'name' => 'Меленки',
        'latitude' => '55.3387017',
        'longitude' => '41.634124',
    ],
    'city564' => [
        'name' => 'Мелеуз',
        'latitude' => '52.9590637',
        'longitude' => '55.9283483',
    ],
    'city565' => [
        'name' => 'Менделеевск',
        'latitude' => '55.8950646',
        'longitude' => '52.3144177',
    ],
    'city566' => [
        'name' => 'Мензелинск',
        'latitude' => '55.7270908',
        'longitude' => '53.1005321',
    ],
    'city567' => [
        'name' => 'Мещовск',
        'latitude' => '54.3191127',
        'longitude' => '35.2816065',
    ],
    'city568' => [
        'name' => 'Миасс',
        'latitude' => '55.0455774',
        'longitude' => '60.1077757',
    ],
    'city569' => [
        'name' => 'Микунь',
        'latitude' => '62.3580188',
        'longitude' => '50.0719738',
    ],
    'city570' => [
        'name' => 'Миллерово',
        'latitude' => '48.925821',
        'longitude' => '40.3983302',
    ],
    'city571' => [
        'name' => 'Минеральные Воды',
        'latitude' => '44.2088942',
        'longitude' => '43.1383482',
    ],
    'city572' => [
        'name' => 'Минусинск',
        'latitude' => '53.7105509',
        'longitude' => '91.6871866',
    ],
    'city573' => [
        'name' => 'Миньяр',
        'latitude' => '55.0709601',
        'longitude' => '57.5484435',
    ],
    'city574' => [
        'name' => 'Мирный',
        'latitude' => '62.7644267',
        'longitude' => '40.3359976',
    ],
    'city575' => [
        'name' => 'Михайлов',
        'latitude' => '54.2296493',
        'longitude' => '39.0090857',
    ],
    'city576' => [
        'name' => 'Михайловка',
        'latitude' => '50.0708749',
        'longitude' => '43.2400847',
    ],
    'city577' => [
        'name' => 'Михайловск',
        'latitude' => '56.4369736',
        'longitude' => '59.113865',
    ],
    'city578' => [
        'name' => 'Мичуринск',
        'latitude' => '52.891294',
        'longitude' => '40.510475',
    ],
    'city579' => [
        'name' => 'Могоча',
        'latitude' => '53.7362465',
        'longitude' => '119.7661232',
    ],
    'city580' => [
        'name' => 'Можайск',
        'latitude' => '55.5069819',
        'longitude' => '36.0240724',
    ],
    'city581' => [
        'name' => 'Можга',
        'latitude' => '56.4427219',
        'longitude' => '52.2138882',
    ],
    'city582' => [
        'name' => 'Моздок',
        'latitude' => '43.7471209',
        'longitude' => '44.6571456',
    ],
    'city583' => [
        'name' => 'Мончегорск',
        'latitude' => '67.9385206',
        'longitude' => '32.9358886',
    ],
    'city584' => [
        'name' => 'Морозовск',
        'latitude' => '48.3511724',
        'longitude' => '41.8308006',
    ],
    'city585' => [
        'name' => 'Моршанск',
        'latitude' => '53.4436469',
        'longitude' => '41.8115687',
    ],
    'city586' => [
        'name' => 'Мосальск',
        'latitude' => '54.4825589',
        'longitude' => '34.987206',
    ],
    'city587' => [
        'name' => 'Муравленко',
        'latitude' => '63.794188',
        'longitude' => '74.494913',
    ],
    'city588' => [
        'name' => 'Мураши',
        'latitude' => '59.3956347',
        'longitude' => '48.9637651',
    ],
    'city589' => [
        'name' => 'Мурманск',
        'latitude' => '69.0076958',
        'longitude' => '33.0686019',
    ],
    'city590' => [
        'name' => 'Муром',
        'latitude' => '55.5632276',
        'longitude' => '42.023006',
    ],
    'city591' => [
        'name' => 'Мценск',
        'latitude' => '53.2790021',
        'longitude' => '36.574992',
    ],
    'city592' => [
        'name' => 'Мыски',
        'latitude' => '53.7125516',
        'longitude' => '87.8056657',
    ],
    'city593' => [
        'name' => 'Мытищи',
        'latitude' => '55.9104647',
        'longitude' => '37.7363702',
    ],
    'city594' => [
        'name' => 'Мышкин',
        'latitude' => '57.7881664',
        'longitude' => '38.4542816',
    ],
    'city595' => [
        'name' => 'Набережные Челны',
        'latitude' => '55.7436475',
        'longitude' => '52.3958739',
    ],
    'city596' => [
        'name' => 'Навашино',
        'latitude' => '55.5439105',
        'longitude' => '42.1887734',
    ],
    'city597' => [
        'name' => 'Наволоки',
        'latitude' => '57.4678426',
        'longitude' => '41.9607371',
    ],
    'city598' => [
        'name' => 'Надым',
        'latitude' => '65.5377514',
        'longitude' => '72.5182746',
    ],
    'city599' => [
        'name' => 'Назарово',
        'latitude' => '56.0113176',
        'longitude' => '90.4167947',
    ],
    'city600' => [
        'name' => 'Назрань',
        'latitude' => '43.2257977',
        'longitude' => '44.764685',
    ],
    'city601' => [
        'name' => 'Называевск',
        'latitude' => '55.5688811',
        'longitude' => '71.3502572',
    ],
    'city602' => [
        'name' => 'Нальчик',
        'latitude' => '43.4846312',
        'longitude' => '43.6070316',
    ],
    'city603' => [
        'name' => 'Нариманов',
        'latitude' => '46.6916597',
        'longitude' => '47.8501624',
    ],
    'city604' => [
        'name' => 'Наро-Фоминск',
        'latitude' => '55.3802749',
        'longitude' => '36.7608038',
    ],
    'city605' => [
        'name' => 'Нарткала',
        'latitude' => '43.5577208',
        'longitude' => '43.8576411',
    ],
    'city606' => [
        'name' => 'Нарьян-Мар',
        'latitude' => '67.6381525',
        'longitude' => '53.0069336',
    ],
    'city607' => [
        'name' => 'Находка',
        'latitude' => '42.8240404',
        'longitude' => '132.8927812',
    ],
    'city608' => [
        'name' => 'Невель',
        'latitude' => '56.0201544',
        'longitude' => '29.9240505',
    ],
    'city609' => [
        'name' => 'Невельск',
        'latitude' => '46.6527314',
        'longitude' => '141.8631741',
    ],
    'city610' => [
        'name' => 'Невинномысск',
        'latitude' => '44.6227404',
        'longitude' => '41.9476147',
    ],
    'city611' => [
        'name' => 'Невьянск',
        'latitude' => '57.491233',
        'longitude' => '60.2181839',
    ],
    'city612' => [
        'name' => 'Нелидово',
        'latitude' => '56.2232417',
        'longitude' => '32.7766656',
    ],
    'city613' => [
        'name' => 'Неман',
        'latitude' => '55.0315543',
        'longitude' => '22.0323961',
    ],
    'city614' => [
        'name' => 'Нерехта',
        'latitude' => '57.4543706',
        'longitude' => '40.5725438',
    ],
    'city615' => [
        'name' => 'Нерчинск',
        'latitude' => '51.9595512',
        'longitude' => '116.5854018',
    ],
    'city616' => [
        'name' => 'Нерюнгри',
        'latitude' => '56.6600322',
        'longitude' => '124.72031',
    ],
    'city617' => [
        'name' => 'Нестеров',
        'latitude' => '54.6314454',
        'longitude' => '22.5713658',
    ],
    'city618' => [
        'name' => 'Нефтегорск',
        'latitude' => '52.797259',
        'longitude' => '51.1637126',
    ],
    'city619' => [
        'name' => 'Нефтекамск',
        'latitude' => '56.0883075',
        'longitude' => '54.2483391',
    ],
    'city620' => [
        'name' => 'Нефтекумск',
        'latitude' => '44.7544866',
        'longitude' => '44.9865041',
    ],
    'city621' => [
        'name' => 'Нефтеюганск',
        'latitude' => '61.0882837',
        'longitude' => '72.6164185',
    ],
    'city622' => [
        'name' => 'Нея',
        'latitude' => '58.2944499',
        'longitude' => '43.8780965',
    ],
    'city623' => [
        'name' => 'Нижневартовск',
        'latitude' => '60.9397379',
        'longitude' => '76.5696206',
    ],
    'city624' => [
        'name' => 'Нижнекамск',
        'latitude' => '55.6311963',
        'longitude' => '51.814407',
    ],
    'city625' => [
        'name' => 'Нижнеудинск',
        'latitude' => '54.8969105',
        'longitude' => '99.0313481',
    ],
    'city626' => [
        'name' => 'Нижние Серги',
        'latitude' => '56.6544606',
        'longitude' => '59.2952291',
    ],
    'city627' => [
        'name' => 'Нижний Ломов',
        'latitude' => '53.5301274',
        'longitude' => '43.6729216',
    ],
    'city628' => [
        'name' => 'Нижний Новгород',
        'latitude' => '56.3242093',
        'longitude' => '44.0053948',
    ],
    'city629' => [
        'name' => 'Нижний Тагил',
        'latitude' => '57.9101038',
        'longitude' => '59.9813242',
    ],
    'city630' => [
        'name' => 'Нижняя Салда',
        'latitude' => '58.0749243',
        'longitude' => '60.7026555',
    ],
    'city631' => [
        'name' => 'Нижняя Тура',
        'latitude' => '58.6310942',
        'longitude' => '59.8521265',
    ],
    'city632' => [
        'name' => 'Николаевск',
        'latitude' => '50.0166952',
        'longitude' => '45.4733204',
    ],
    'city633' => [
        'name' => 'Николаевск-на-Амуре',
        'latitude' => '53.1461943',
        'longitude' => '140.7109642',
    ],
    'city634' => [
        'name' => 'Никольск',
        'latitude' => '59.5350162',
        'longitude' => '45.4575468',
    ],
    'city635' => [
        'name' => 'Никольское',
        'latitude' => '59.7042633',
        'longitude' => '30.7874879',
    ],
    'city636' => [
        'name' => 'Новая Ладога',
        'latitude' => '60.1100013',
        'longitude' => '32.3141446',
    ],
    'city637' => [
        'name' => 'Новая Ляля',
        'latitude' => '59.053961',
        'longitude' => '60.5945405',
    ],
    'city638' => [
        'name' => 'Новоалександровск',
        'latitude' => '45.4933561',
        'longitude' => '41.2154482',
    ],
    'city639' => [
        'name' => 'Новоалтайск',
        'latitude' => '53.4120811',
        'longitude' => '83.9311249',
    ],
    'city640' => [
        'name' => 'Новоаннинский',
        'latitude' => '50.5296873',
        'longitude' => '42.6666038',
    ],
    'city641' => [
        'name' => 'Нововоронеж',
        'latitude' => '51.3092463',
        'longitude' => '39.2162865',
    ],
    'city642' => [
        'name' => 'Новодвинск',
        'latitude' => '64.4136023',
        'longitude' => '40.8208003',
    ],
    'city643' => [
        'name' => 'Новозыбков',
        'latitude' => '52.5371426',
        'longitude' => '31.9356826',
    ],
    'city644' => [
        'name' => 'Новокубанск',
        'latitude' => '45.1038782',
        'longitude' => '41.0473679',
    ],
    'city645' => [
        'name' => 'Новокузнецк',
        'latitude' => '53.7942757',
        'longitude' => '87.2144046',
    ],
    'city646' => [
        'name' => 'Новокуйбышевск',
        'latitude' => '53.0995303',
        'longitude' => '49.9477662',
    ],
    'city647' => [
        'name' => 'Новомичуринск',
        'latitude' => '54.0377979',
        'longitude' => '39.7467023',
    ],
    'city648' => [
        'name' => 'Новомосковск',
        'latitude' => '54.0109754',
        'longitude' => '38.2915652',
    ],
    'city649' => [
        'name' => 'Новопавловск',
        'latitude' => '43.9617565',
        'longitude' => '43.6342855',
    ],
    'city650' => [
        'name' => 'Новоржев',
        'latitude' => '57.0298332',
        'longitude' => '29.343333',
    ],
    'city651' => [
        'name' => 'Новороссийск',
        'latitude' => '44.7234264',
        'longitude' => '37.7687218',
    ],
    'city652' => [
        'name' => 'Новосибирск',
        'latitude' => '55.0281016',
        'longitude' => '82.9210575',
    ],
    'city653' => [
        'name' => 'Новосиль',
        'latitude' => '52.9747225',
        'longitude' => '37.0438402',
    ],
    'city654' => [
        'name' => 'Новосокольники',
        'latitude' => '56.3407627',
        'longitude' => '30.1527712',
    ],
    'city655' => [
        'name' => 'Новотроицк',
        'latitude' => '51.1965071',
        'longitude' => '58.3017455',
    ],
    'city656' => [
        'name' => 'Новоузенск',
        'latitude' => '50.4551744',
        'longitude' => '48.1412622',
    ],
    'city657' => [
        'name' => 'Новоульяновск',
        'latitude' => '54.1447691',
        'longitude' => '48.3911701',
    ],
    'city658' => [
        'name' => 'Новоуральск',
        'latitude' => '57.2471507',
        'longitude' => '60.095701',
    ],
    'city659' => [
        'name' => 'Новохоперск',
        'latitude' => '51.0953461',
        'longitude' => '41.6173714',
    ],
    'city660' => [
        'name' => 'Новочебоксарск',
        'latitude' => '56.109486',
        'longitude' => '47.4791429',
    ],
    'city661' => [
        'name' => 'Новочеркасск',
        'latitude' => '47.4119248',
        'longitude' => '40.1042066',
    ],
    'city662' => [
        'name' => 'Новошахтинск',
        'latitude' => '47.7576522',
        'longitude' => '39.9364709',
    ],
    'city663' => [
        'name' => 'Новый Оскол',
        'latitude' => '50.7635162',
        'longitude' => '37.8774026',
    ],
    'city664' => [
        'name' => 'Новый Уренгой',
        'latitude' => '66.0840036',
        'longitude' => '76.6810032',
    ],
    'city665' => [
        'name' => 'Ногинск',
        'latitude' => '55.8686239',
        'longitude' => '38.4621635',
    ],
    'city666' => [
        'name' => 'Нолинск',
        'latitude' => '57.5596946',
        'longitude' => '49.9357867',
    ],
    'city667' => [
        'name' => 'Норильск',
        'latitude' => '69.3490828',
        'longitude' => '88.2009965',
    ],
    'city668' => [
        'name' => 'Ноябрьск',
        'latitude' => '63.201846',
        'longitude' => '75.4509665',
    ],
    'city669' => [
        'name' => 'Нурлат',
        'latitude' => '54.4281578',
        'longitude' => '50.8050431',
    ],
    'city670' => [
        'name' => 'Нытва',
        'latitude' => '57.9337429',
        'longitude' => '55.3357261',
    ],
    'city671' => [
        'name' => 'Нюрба',
        'latitude' => '63.2828775',
        'longitude' => '118.324325',
    ],
    'city672' => [
        'name' => 'Нягань',
        'latitude' => '62.1454839',
        'longitude' => '65.3944361',
    ],
    'city673' => [
        'name' => 'Нязепетровск',
        'latitude' => '56.0537199',
        'longitude' => '59.6096791',
    ],
    'city674' => [
        'name' => 'Няндома',
        'latitude' => '61.6653735',
        'longitude' => '40.2061699',
    ],
    'city675' => [
        'name' => 'Облучье',
        'latitude' => '49.0188344',
        'longitude' => '131.0539984',
    ],
    'city676' => [
        'name' => 'Обнинск',
        'latitude' => '55.0943892',
        'longitude' => '36.6121785',
    ],
    'city677' => [
        'name' => 'Обоянь',
        'latitude' => '51.212012',
        'longitude' => '36.275425',
    ],
    'city678' => [
        'name' => 'Обь',
        'latitude' => '54.9945882',
        'longitude' => '82.6937925',
    ],
    'city679' => [
        'name' => 'Одинцово',
        'latitude' => '55.6789292',
        'longitude' => '37.2636389',
    ],
    'city680' => [
        'name' => 'Озерск',
        'latitude' => '54.4084804',
        'longitude' => '22.013508',
    ],
    'city681' => [
        'name' => 'Озеры',
        'latitude' => '54.8539944',
        'longitude' => '38.55987',
    ],
    'city682' => [
        'name' => 'Октябрьск',
        'latitude' => '53.1640886',
        'longitude' => '48.6707463',
    ],
    'city683' => [
        'name' => 'Октябрьский',
        'latitude' => '54.4815344',
        'longitude' => '53.4656611',
    ],
    'city684' => [
        'name' => 'Окуловка',
        'latitude' => '58.3908717',
        'longitude' => '33.2902474',
    ],
    'city685' => [
        'name' => 'Олекминск',
        'latitude' => '60.3758203',
        'longitude' => '120.406013',
    ],
    'city686' => [
        'name' => 'Оленегорск',
        'latitude' => '68.1422068',
        'longitude' => '33.2670094',
    ],
    'city687' => [
        'name' => 'Олонец',
        'latitude' => '60.9793604',
        'longitude' => '32.9726031',
    ],
    'city688' => [
        'name' => 'Омск',
        'latitude' => '54.9848136',
        'longitude' => '73.3674638',
    ],
    'city689' => [
        'name' => 'Омутнинск',
        'latitude' => '58.6697684',
        'longitude' => '52.1893554',
    ],
    'city690' => [
        'name' => 'Онега',
        'latitude' => '63.9163966',
        'longitude' => '38.0805749',
    ],
    'city691' => [
        'name' => 'Опочка',
        'latitude' => '56.7107956',
        'longitude' => '28.6717455',
    ],
    'city692' => [
        'name' => 'Орёл',
        'latitude' => '52.9672573',
        'longitude' => '36.0696479',
    ],
    'city693' => [
        'name' => 'Оренбург',
        'latitude' => '51.7875191',
        'longitude' => '55.1017379',
    ],
    'city694' => [
        'name' => 'Орехово-Зуево',
        'latitude' => '55.8151729',
        'longitude' => '38.9870711',
    ],
    'city695' => [
        'name' => 'Орлов',
        'latitude' => '58.5389402',
        'longitude' => '48.8929268',
    ],
    'city696' => [
        'name' => 'Орск',
        'latitude' => '51.2293069',
        'longitude' => '58.4751889',
    ],
    'city697' => [
        'name' => 'Оса',
        'latitude' => '57.2889992',
        'longitude' => '55.4688982',
    ],
    'city698' => [
        'name' => 'Осинники',
        'latitude' => '53.5987397',
        'longitude' => '87.3369948',
    ],
    'city699' => [
        'name' => 'Осташков',
        'latitude' => '57.1457205',
        'longitude' => '33.1116707',
    ],
    'city700' => [
        'name' => 'Остров',
        'latitude' => '57.3452408',
        'longitude' => '28.3437107',
    ],
    'city701' => [
        'name' => 'Островной',
        'latitude' => '68.0509133',
        'longitude' => '39.5076034',
    ],
    'city702' => [
        'name' => 'Острогожск',
        'latitude' => '50.8678083',
        'longitude' => '39.0406398',
    ],
    'city703' => [
        'name' => 'Отрадное',
        'latitude' => '59.772596',
        'longitude' => '30.7988403',
    ],
    'city704' => [
        'name' => 'Отрадный',
        'latitude' => '53.3800609',
        'longitude' => '51.3438695',
    ],
    'city705' => [
        'name' => 'Оха',
        'latitude' => '53.5868238',
        'longitude' => '142.941221',
    ],
    'city706' => [
        'name' => 'Оханск',
        'latitude' => '57.7178946',
        'longitude' => '55.387153',
    ],
    'city707' => [
        'name' => 'Очер',
        'latitude' => '57.8851991',
        'longitude' => '54.7161756',
    ],
    'city708' => [
        'name' => 'Павлово',
        'latitude' => '55.9797995',
        'longitude' => '43.0996232',
    ],
    'city709' => [
        'name' => 'Павловск',
        'latitude' => '50.4533684',
        'longitude' => '40.1369087',
    ],
    'city710' => [
        'name' => 'Павловский Посад',
        'latitude' => '55.7806718',
        'longitude' => '38.6596047',
    ],
    'city711' => [
        'name' => 'Палласовка',
        'latitude' => '50.0501422',
        'longitude' => '46.8803355',
    ],
    'city712' => [
        'name' => 'Партизанск',
        'latitude' => '43.1279833',
        'longitude' => '133.1264754',
    ],
    'city713' => [
        'name' => 'Певек',
        'latitude' => '69.7018051',
        'longitude' => '170.2999194',
    ],
    'city714' => [
        'name' => 'Пенза',
        'latitude' => '53.1753884',
        'longitude' => '45.0347408',
    ],
    'city715' => [
        'name' => 'Первомайск',
        'latitude' => '54.8676182',
        'longitude' => '43.8012829',
    ],
    'city716' => [
        'name' => 'Первоуральск',
        'latitude' => '56.9081665',
        'longitude' => '59.9429205',
    ],
    'city717' => [
        'name' => 'Перевоз',
        'latitude' => '55.596904',
        'longitude' => '44.5450268',
    ],
    'city718' => [
        'name' => 'Пересвет',
        'latitude' => '56.4158828',
        'longitude' => '38.1733567',
    ],
    'city719' => [
        'name' => 'Переславль-Залесский',
        'latitude' => '56.7360435',
        'longitude' => '38.8543064',
    ],
    'city720' => [
        'name' => 'Пермь',
        'latitude' => '58.0103211',
        'longitude' => '56.2341778',
    ],
    'city721' => [
        'name' => 'Пестово',
        'latitude' => '58.5973944',
        'longitude' => '35.8144523',
    ],
    'city722' => [
        'name' => 'Петров Вал',
        'latitude' => '50.1380355',
        'longitude' => '45.2091455',
    ],
    'city723' => [
        'name' => 'Петровск',
        'latitude' => '52.3093782',
        'longitude' => '45.3851649',
    ],
    'city724' => [
        'name' => 'Петровск-Забайкальский',
        'latitude' => '51.2748381',
        'longitude' => '108.8467139',
    ],
    'city725' => [
        'name' => 'Петрозаводск',
        'latitude' => '61.78909',
        'longitude' => '34.3596263',
    ],
    'city726' => [
        'name' => 'Петропавловск-Камчатский',
        'latitude' => '53.0370213',
        'longitude' => '158.6559142',
    ],
    'city727' => [
        'name' => 'Петухово',
        'latitude' => '55.0649932',
        'longitude' => '67.8874369',
    ],
    'city728' => [
        'name' => 'Петушки',
        'latitude' => '55.9297657',
        'longitude' => '39.4507913',
    ],
    'city729' => [
        'name' => 'Печора',
        'latitude' => '65.1485717',
        'longitude' => '57.22388',
    ],
    'city730' => [
        'name' => 'Печоры',
        'latitude' => '57.8146689',
        'longitude' => '27.6222823',
    ],
    'city731' => [
        'name' => 'Пикалево',
        'latitude' => '59.5130655',
        'longitude' => '34.1773982',
    ],
    'city732' => [
        'name' => 'Пионерский',
        'latitude' => '54.9516927',
        'longitude' => '20.227697',
    ],
    'city733' => [
        'name' => 'Питкяранта',
        'latitude' => '61.5756886',
        'longitude' => '31.4641309',
    ],
    'city734' => [
        'name' => 'Плавск',
        'latitude' => '53.7095993',
        'longitude' => '37.2863144',
    ],
    'city735' => [
        'name' => 'Пласт',
        'latitude' => '54.3691832',
        'longitude' => '60.8152305',
    ],
    'city736' => [
        'name' => 'Плес',
        'latitude' => '57.4605304',
        'longitude' => '41.512301',
    ],
    'city737' => [
        'name' => 'Поворино',
        'latitude' => '51.1953446',
        'longitude' => '42.2472432',
    ],
    'city738' => [
        'name' => 'Подольск',
        'latitude' => '55.4389588',
        'longitude' => '37.57027',
    ],
    'city739' => [
        'name' => 'Подпорожье',
        'latitude' => '60.9127463',
        'longitude' => '34.1567832',
    ],
    'city740' => [
        'name' => 'Покачи',
        'latitude' => '61.7421977',
        'longitude' => '75.5942069',
    ],
    'city741' => [
        'name' => 'Покров',
        'latitude' => '55.9167118',
        'longitude' => '39.1733641',
    ],
    'city742' => [
        'name' => 'Покровск',
        'latitude' => '61.4843538',
        'longitude' => '129.1482195',
    ],
    'city743' => [
        'name' => 'Полевской',
        'latitude' => '56.4958085',
        'longitude' => '60.2366314',
    ],
    'city744' => [
        'name' => 'Полесск',
        'latitude' => '54.8626321',
        'longitude' => '21.0998148',
    ],
    'city745' => [
        'name' => 'Полысаево',
        'latitude' => '54.6053968',
        'longitude' => '86.2808803',
    ],
    'city746' => [
        'name' => 'Полярные Зори',
        'latitude' => '67.3730192',
        'longitude' => '32.497541',
    ],
    'city747' => [
        'name' => 'Полярный',
        'latitude' => '69.1988373',
        'longitude' => '33.4509985',
    ],
    'city748' => [
        'name' => 'Поронайск',
        'latitude' => '49.2387983',
        'longitude' => '143.1007104',
    ],
    'city749' => [
        'name' => 'Порхов',
        'latitude' => '57.7764223',
        'longitude' => '29.5436424',
    ],
    'city750' => [
        'name' => 'Похвистнево',
        'latitude' => '53.6498197',
        'longitude' => '52.1235517',
    ],
    'city751' => [
        'name' => 'Почеп',
        'latitude' => '52.9154724',
        'longitude' => '33.4744608',
    ],
    'city752' => [
        'name' => 'Починок',
        'latitude' => '54.4063031',
        'longitude' => '32.4397914',
    ],
    'city753' => [
        'name' => 'Пошехонье',
        'latitude' => '58.506328',
        'longitude' => '39.1210034',
    ],
    'city754' => [
        'name' => 'Правдинск',
        'latitude' => '54.4430604',
        'longitude' => '21.0083638',
    ],
    'city755' => [
        'name' => 'Приволжск',
        'latitude' => '57.3807249',
        'longitude' => '41.2809239',
    ],
    'city756' => [
        'name' => 'Приморск',
        'latitude' => '54.7311185',
        'longitude' => '19.9983108',
    ],
    'city757' => [
        'name' => 'Приморско-Ахтарск',
        'latitude' => '46.0515',
        'longitude' => '38.1704654',
    ],
    'city758' => [
        'name' => 'Приозерск',
        'latitude' => '61.03313',
        'longitude' => '30.15876',
    ],
    'city759' => [
        'name' => 'Прокопьевск',
        'latitude' => '53.8604562',
        'longitude' => '86.7183428',
    ],
    'city760' => [
        'name' => 'Пролетарск',
        'latitude' => '46.7038968',
        'longitude' => '41.7274533',
    ],
    'city761' => [
        'name' => 'Протвино',
        'latitude' => '54.8706614',
        'longitude' => '37.2183307',
    ],
    'city762' => [
        'name' => 'Прохладный',
        'latitude' => '43.7589521',
        'longitude' => '44.0101936',
    ],
    'city763' => [
        'name' => 'Псков',
        'latitude' => '57.819284',
        'longitude' => '28.3318188',
    ],
    'city764' => [
        'name' => 'Пугачев',
        'latitude' => '52.0158464',
        'longitude' => '48.7972652',
    ],
    'city765' => [
        'name' => 'Пудож',
        'latitude' => '61.8059147',
        'longitude' => '36.5330088',
    ],
    'city766' => [
        'name' => 'Пустошка',
        'latitude' => '56.3375131',
        'longitude' => '29.3668243',
    ],
    'city767' => [
        'name' => 'Пучеж',
        'latitude' => '56.982075',
        'longitude' => '43.1683878',
    ],
    'city768' => [
        'name' => 'Пушкино',
        'latitude' => '56.0104548',
        'longitude' => '37.8471438',
    ],
    'city769' => [
        'name' => 'Пущино',
        'latitude' => '54.832521',
        'longitude' => '37.6210428',
    ],
    'city770' => [
        'name' => 'Пыталово',
        'latitude' => '57.0637109',
        'longitude' => '27.9234759',
    ],
    'city771' => [
        'name' => 'Пыть-Ях',
        'latitude' => '60.7585769',
        'longitude' => '72.8366445',
    ],
    'city772' => [
        'name' => 'Пятигорск',
        'latitude' => '44.0411669',
        'longitude' => '43.0661091',
    ],
    'city773' => [
        'name' => 'Радужный',
        'latitude' => '55.9961034',
        'longitude' => '40.3323247',
    ],
    'city774' => [
        'name' => 'Райчихинск',
        'latitude' => '49.7941882',
        'longitude' => '129.4112149',
    ],
    'city775' => [
        'name' => 'Раменское',
        'latitude' => '55.549529',
        'longitude' => '38.273015',
    ],
    'city776' => [
        'name' => 'Рассказово',
        'latitude' => '52.6537517',
        'longitude' => '41.8743779',
    ],
    'city777' => [
        'name' => 'Ревда',
        'latitude' => '56.79869',
        'longitude' => '59.9071464',
    ],
    'city778' => [
        'name' => 'Реж',
        'latitude' => '57.3717914',
        'longitude' => '61.3833223',
    ],
    'city779' => [
        'name' => 'Реутов',
        'latitude' => '55.758236',
        'longitude' => '37.8619443',
    ],
    'city780' => [
        'name' => 'Ржев',
        'latitude' => '56.2629393',
        'longitude' => '34.3291178',
    ],
    'city781' => [
        'name' => 'Родники',
        'latitude' => '57.1024137',
        'longitude' => '41.7298908',
    ],
    'city782' => [
        'name' => 'Рославль',
        'latitude' => '53.9449601',
        'longitude' => '32.8479617',
    ],
    'city783' => [
        'name' => 'Россошь',
        'latitude' => '50.170089',
        'longitude' => '39.6225534',
    ],
    'city784' => [
        'name' => 'Ростов',
        'latitude' => '57.2050177',
        'longitude' => '39.4378357',
    ],
    'city785' => [
        'name' => 'Ростов-на-Дону',
        'latitude' => '47.2224364',
        'longitude' => '39.7187866',
    ],
    'city786' => [
        'name' => 'Рошаль',
        'latitude' => '55.6632504',
        'longitude' => '39.8655434',
    ],
    'city787' => [
        'name' => 'Ртищево',
        'latitude' => '52.2616298',
        'longitude' => '43.7842399',
    ],
    'city788' => [
        'name' => 'Рубцовск',
        'latitude' => '51.5013075',
        'longitude' => '81.2077729',
    ],
    'city789' => [
        'name' => 'Рудня',
        'latitude' => '54.9441357',
        'longitude' => '31.0794758',
    ],
    'city790' => [
        'name' => 'Руза',
        'latitude' => '55.7015302',
        'longitude' => '36.1960043',
    ],
    'city791' => [
        'name' => 'Рузаевка',
        'latitude' => '54.0583238',
        'longitude' => '44.949116',
    ],
    'city792' => [
        'name' => 'Рыбинск',
        'latitude' => '58.0483802',
        'longitude' => '38.858338',
    ],
    'city793' => [
        'name' => 'Рыбное',
        'latitude' => '54.7255937',
        'longitude' => '39.513438',
    ],
    'city794' => [
        'name' => 'Рыльск',
        'latitude' => '51.568165',
        'longitude' => '34.6802178',
    ],
    'city795' => [
        'name' => 'Ряжск',
        'latitude' => '53.7067718',
        'longitude' => '40.0521358',
    ],
    'city796' => [
        'name' => 'Рязань',
        'latitude' => '54.625457',
        'longitude' => '39.7359992',
    ],
    'city797' => [
        'name' => 'Саки',
        'latitude' => '45.1342889',
        'longitude' => '33.6032508',
    ],
    'city798' => [
        'name' => 'Салават',
        'latitude' => '53.3616311',
        'longitude' => '55.9245559',
    ],
    'city799' => [
        'name' => 'Салаир',
        'latitude' => '54.2351588',
        'longitude' => '85.8029215',
    ],
    'city800' => [
        'name' => 'Салехард',
        'latitude' => '66.5493568',
        'longitude' => '66.6083994',
    ],
    'city801' => [
        'name' => 'Сальск',
        'latitude' => '46.4751689',
        'longitude' => '41.5412229',
    ],
    'city802' => [
        'name' => 'Самара',
        'latitude' => '53.1951657',
        'longitude' => '50.1067691',
    ],
    'city803' => [
        'name' => 'Саранск',
        'latitude' => '54.1807601',
        'longitude' => '45.1862263',
    ],
    'city804' => [
        'name' => 'Сарапул',
        'latitude' => '56.4616117',
        'longitude' => '53.8036967',
    ],
    'city805' => [
        'name' => 'Саратов',
        'latitude' => '51.530376',
        'longitude' => '45.9530257',
    ],
    'city806' => [
        'name' => 'Саров',
        'latitude' => '54.9227002',
        'longitude' => '43.3447792',
    ],
    'city807' => [
        'name' => 'Сасово',
        'latitude' => '54.350807',
        'longitude' => '41.9117458',
    ],
    'city808' => [
        'name' => 'Сатка',
        'latitude' => '55.0404497',
        'longitude' => '59.0288153',
    ],
    'city809' => [
        'name' => 'Сафоново',
        'latitude' => '55.1199868',
        'longitude' => '33.233799',
    ],
    'city810' => [
        'name' => 'Саяногорск',
        'latitude' => '53.1008226',
        'longitude' => '91.4121643',
    ],
    'city811' => [
        'name' => 'Саянск',
        'latitude' => '54.1107787',
        'longitude' => '102.1802563',
    ],
    'city812' => [
        'name' => 'Светлогорск',
        'latitude' => '54.9439566',
        'longitude' => '20.1514789',
    ],
    'city813' => [
        'name' => 'Светлоград',
        'latitude' => '45.3284769',
        'longitude' => '42.8566923',
    ],
    'city814' => [
        'name' => 'Светлый',
        'latitude' => '54.6774051',
        'longitude' => '20.1356625',
    ],
    'city815' => [
        'name' => 'Светогорск',
        'latitude' => '61.1112679',
        'longitude' => '28.8726666',
    ],
    'city816' => [
        'name' => 'Свирск',
        'latitude' => '53.0842576',
        'longitude' => '103.3364192',
    ],
    'city817' => [
        'name' => 'Свободный',
        'latitude' => '51.361264',
        'longitude' => '128.1218995',
    ],
    'city818' => [
        'name' => 'Себеж',
        'latitude' => '56.2907663',
        'longitude' => '28.4725735',
    ],
    'city819' => [
        'name' => 'Северобайкальск',
        'latitude' => '55.6357165',
        'longitude' => '109.3362606',
    ],
    'city820' => [
        'name' => 'Северодвинск',
        'latitude' => '64.56253',
        'longitude' => '39.8182715',
    ],
    'city821' => [
        'name' => 'Северо-Курильск',
        'latitude' => '50.6731056',
        'longitude' => '156.1280722',
    ],
    'city822' => [
        'name' => 'Североморск',
        'latitude' => '69.0765029',
        'longitude' => '33.4178354',
    ],
    'city823' => [
        'name' => 'Североуральск',
        'latitude' => '60.1533333',
        'longitude' => '59.9525274',
    ],
    'city824' => [
        'name' => 'Северск',
        'latitude' => '56.6031143',
        'longitude' => '84.8809687',
    ],
    'city825' => [
        'name' => 'Севск',
        'latitude' => '52.1484215',
        'longitude' => '34.4918198',
    ],
    'city826' => [
        'name' => 'Сегежа',
        'latitude' => '63.7437211',
        'longitude' => '34.3126755',
    ],
    'city827' => [
        'name' => 'Сельцо',
        'latitude' => '53.3738801',
        'longitude' => '34.1059226',
    ],
    'city828' => [
        'name' => 'Семенов',
        'latitude' => '56.788935',
        'longitude' => '44.4903571',
    ],
    'city829' => [
        'name' => 'Семикаракорск',
        'latitude' => '47.5177981',
        'longitude' => '40.811585',
    ],
    'city830' => [
        'name' => 'Семилуки',
        'latitude' => '51.6951846',
        'longitude' => '39.0189797',
    ],
    'city831' => [
        'name' => 'Сенгилей',
        'latitude' => '53.9590553',
        'longitude' => '48.7767869',
    ],
    'city832' => [
        'name' => 'Серафимович',
        'latitude' => '49.566286',
        'longitude' => '42.7360013',
    ],
    'city833' => [
        'name' => 'Сергач',
        'latitude' => '55.5200364',
        'longitude' => '45.4813193',
    ],
    'city834' => [
        'name' => 'Сергиев Посад',
        'latitude' => '56.3063411',
        'longitude' => '38.1502568',
    ],
    'city835' => [
        'name' => 'Сердобск',
        'latitude' => '52.4697532',
        'longitude' => '44.2122688',
    ],
    'city836' => [
        'name' => 'Серов',
        'latitude' => '59.6048651',
        'longitude' => '60.5752136',
    ],
    'city837' => [
        'name' => 'Серпухов',
        'latitude' => '54.9225396',
        'longitude' => '37.4032682',
    ],
    'city838' => [
        'name' => 'Сертолово',
        'latitude' => '60.14458',
        'longitude' => '30.2094595',
    ],
    'city839' => [
        'name' => 'Сибай',
        'latitude' => '52.7205811',
        'longitude' => '58.6663303',
    ],
    'city840' => [
        'name' => 'Сим',
        'latitude' => '54.9906584',
        'longitude' => '57.6899045',
    ],
    'city841' => [
        'name' => 'Симферополь',
        'latitude' => '44.9482645',
        'longitude' => '34.100117',
    ],
    'city842' => [
        'name' => 'Сковородино',
        'latitude' => '53.9871004',
        'longitude' => '123.943729',
    ],
    'city843' => [
        'name' => 'Скопин',
        'latitude' => '53.8236028',
        'longitude' => '39.5493286',
    ],
    'city844' => [
        'name' => 'Славгород',
        'latitude' => '52.9993053',
        'longitude' => '78.6459674',
    ],
    'city845' => [
        'name' => 'Славск',
        'latitude' => '55.0451054',
        'longitude' => '21.6742294',
    ],
    'city846' => [
        'name' => 'Славянск-на-Кубани',
        'latitude' => '45.2605079',
        'longitude' => '38.1260725',
    ],
    'city847' => [
        'name' => 'Сланцы',
        'latitude' => '59.1178693',
        'longitude' => '28.088106',
    ],
    'city848' => [
        'name' => 'Слободской',
        'latitude' => '58.7311934',
        'longitude' => '50.1670091',
    ],
    'city849' => [
        'name' => 'Слюдянка',
        'latitude' => '51.6562679',
        'longitude' => '103.7186877',
    ],
    'city850' => [
        'name' => 'Смоленск',
        'latitude' => '54.7867168',
        'longitude' => '31.8153366',
    ],
    'city851' => [
        'name' => 'Снежинск',
        'latitude' => '56.085232',
        'longitude' => '60.7324989',
    ],
    'city852' => [
        'name' => 'Снежногорск',
        'latitude' => '69.1921469',
        'longitude' => '33.2382821',
    ],
    'city853' => [
        'name' => 'Собинка',
        'latitude' => '55.993798',
        'longitude' => '40.0180034',
    ],
    'city854' => [
        'name' => 'Советск',
        'latitude' => '55.0810474',
        'longitude' => '21.8886272',
    ],
    'city855' => [
        'name' => 'Советская Гавань',
        'latitude' => '48.9664554',
        'longitude' => '140.2852223',
    ],
    'city856' => [
        'name' => 'Советский',
        'latitude' => '61.3706695',
        'longitude' => '63.566863',
    ],
    'city857' => [
        'name' => 'Сокол',
        'latitude' => '59.4759156',
        'longitude' => '40.1114414',
    ],
    'city858' => [
        'name' => 'Солигалич',
        'latitude' => '59.0786729',
        'longitude' => '42.2877245',
    ],
    'city859' => [
        'name' => 'Соликамск',
        'latitude' => '59.6483518',
        'longitude' => '56.7710358',
    ],
    'city860' => [
        'name' => 'Солнечногорск',
        'latitude' => '56.2148655',
        'longitude' => '37.0967653',
    ],
    'city861' => [
        'name' => 'Сольвычегодск',
        'latitude' => '61.3318091',
        'longitude' => '46.920351',
    ],
    'city862' => [
        'name' => 'Соль-Илецк',
        'latitude' => '51.1634976',
        'longitude' => '54.9895391',
    ],
    'city863' => [
        'name' => 'Сольцы',
        'latitude' => '58.1201693',
        'longitude' => '30.309285',
    ],
    'city864' => [
        'name' => 'Сорочинск',
        'latitude' => '52.4265081',
        'longitude' => '53.1542123',
    ],
    'city865' => [
        'name' => 'Сорск',
        'latitude' => '54.0001451',
        'longitude' => '90.2595674',
    ],
    'city866' => [
        'name' => 'Сортавала',
        'latitude' => '61.7032216',
        'longitude' => '30.6917021',
    ],
    'city867' => [
        'name' => 'Сосенский',
        'latitude' => '54.056525',
        'longitude' => '35.9621458',
    ],
    'city868' => [
        'name' => 'Сосновка',
        'latitude' => '56.2533149',
        'longitude' => '51.2833412',
    ],
    'city869' => [
        'name' => 'Сосновоборск',
        'latitude' => '56.1202088',
        'longitude' => '93.3353411',
    ],
    'city870' => [
        'name' => 'Сосновый Бор',
        'latitude' => '59.8772921',
        'longitude' => '29.1290866',
    ],
    'city871' => [
        'name' => 'Сосногорск',
        'latitude' => '63.5990137',
        'longitude' => '53.8762792',
    ],
    'city872' => [
        'name' => 'Сочи',
        'latitude' => '43.5855829',
        'longitude' => '39.7231419',
    ],
    'city873' => [
        'name' => 'Спас-Деменск',
        'latitude' => '54.4099201',
        'longitude' => '34.0190263',
    ],
    'city874' => [
        'name' => 'Спас-Клепики',
        'latitude' => '55.1291472',
        'longitude' => '40.1745036',
    ],
    'city875' => [
        'name' => 'Спасск',
        'latitude' => '53.927163',
        'longitude' => '43.1860475',
    ],
    'city876' => [
        'name' => 'Спасск-Дальний',
        'latitude' => '44.5900929',
        'longitude' => '132.8157564',
    ],
    'city877' => [
        'name' => 'Спасск-Рязанский',
        'latitude' => '54.4071497',
        'longitude' => '40.3764367',
    ],
    'city878' => [
        'name' => 'Среднеколымск',
        'latitude' => '67.4581664',
        'longitude' => '153.7069511',
    ],
    'city879' => [
        'name' => 'Среднеуральск',
        'latitude' => '56.991883',
        'longitude' => '60.4771953',
    ],
    'city880' => [
        'name' => 'Сретенск',
        'latitude' => '52.2462356',
        'longitude' => '117.7116971',
    ],
    'city881' => [
        'name' => 'Ставрополь',
        'latitude' => '45.0445439',
        'longitude' => '41.9690168',
    ],
    'city882' => [
        'name' => 'Старая Купавна',
        'latitude' => '55.8038411',
        'longitude' => '38.1426144',
    ],
    'city883' => [
        'name' => 'Старая Русса',
        'latitude' => '57.9906873',
        'longitude' => '31.3555076',
    ],
    'city884' => [
        'name' => 'Старица',
        'latitude' => '56.514955',
        'longitude' => '34.9335145',
    ],
    'city885' => [
        'name' => 'Стародуб',
        'latitude' => '52.5851881',
        'longitude' => '32.7603628',
    ],
    'city886' => [
        'name' => 'Старый Крым',
        'latitude' => '45.0290659',
        'longitude' => '35.0900885',
    ],
    'city887' => [
        'name' => 'Старый Оскол',
        'latitude' => '51.2965991',
        'longitude' => '37.8349849',
    ],
    'city888' => [
        'name' => 'Стерлитамак',
        'latitude' => '53.6302498',
        'longitude' => '55.9315707',
    ],
    'city889' => [
        'name' => 'Стрежевой',
        'latitude' => '60.7328199',
        'longitude' => '77.6040323',
    ],
    'city890' => [
        'name' => 'Строитель',
        'latitude' => '50.7845571',
        'longitude' => '36.4886619',
    ],
    'city891' => [
        'name' => 'Струнино',
        'latitude' => '56.3750001',
        'longitude' => '38.583938',
    ],
    'city892' => [
        'name' => 'Ступино',
        'latitude' => '54.9238403',
        'longitude' => '38.1186976',
    ],
    'city893' => [
        'name' => 'Суворов',
        'latitude' => '54.1345367',
        'longitude' => '36.4806933',
    ],
    'city894' => [
        'name' => 'Судак',
        'latitude' => '44.8505913',
        'longitude' => '34.9761591',
    ],
    'city895' => [
        'name' => 'Суджа',
        'latitude' => '51.1919711',
        'longitude' => '35.2719619',
    ],
    'city896' => [
        'name' => 'Судогда',
        'latitude' => '55.949897',
        'longitude' => '40.8563392',
    ],
    'city897' => [
        'name' => 'Суздаль',
        'latitude' => '56.4273814',
        'longitude' => '40.4525581',
    ],
    'city898' => [
        'name' => 'Суоярви',
        'latitude' => '62.0787769',
        'longitude' => '32.3499029',
    ],
    'city899' => [
        'name' => 'Сураж',
        'latitude' => '53.0171239',
        'longitude' => '32.3938351',
    ],
    'city900' => [
        'name' => 'Сургут',
        'latitude' => '61.2539773',
        'longitude' => '73.3961726',
    ],
    'city901' => [
        'name' => 'Суровикино',
        'latitude' => '48.6189756',
        'longitude' => '42.8541308',
    ],
    'city902' => [
        'name' => 'Сурск',
        'latitude' => '53.0760597',
        'longitude' => '45.6911897',
    ],
    'city903' => [
        'name' => 'Сусуман',
        'latitude' => '62.7804628',
        'longitude' => '148.154033',
    ],
    'city904' => [
        'name' => 'Сухиничи',
        'latitude' => '54.0973787',
        'longitude' => '35.3443077',
    ],
    'city905' => [
        'name' => 'Сухой Лог',
        'latitude' => '56.9075938',
        'longitude' => '62.0358708',
    ],
    'city906' => [
        'name' => 'Сызрань',
        'latitude' => '53.1557213',
        'longitude' => '48.4745419',
    ],
    'city907' => [
        'name' => 'Сыктывкар',
        'latitude' => '61.668789',
        'longitude' => '50.8356491',
    ],
    'city908' => [
        'name' => 'Сысерть',
        'latitude' => '56.50052',
        'longitude' => '60.8190708',
    ],
    'city909' => [
        'name' => 'Сычевка',
        'latitude' => '55.8307397',
        'longitude' => '34.277868',
    ],
    'city910' => [
        'name' => 'Сясьстрой',
        'latitude' => '60.1402454',
        'longitude' => '32.5602015',
    ],
    'city911' => [
        'name' => 'Тавда',
        'latitude' => '58.0434196',
        'longitude' => '65.2743232',
    ],
    'city912' => [
        'name' => 'Таганрог',
        'latitude' => '47.2094907',
        'longitude' => '38.935154',
    ],
    'city913' => [
        'name' => 'Тайга',
        'latitude' => '56.0622767',
        'longitude' => '85.6207907',
    ],
    'city914' => [
        'name' => 'Тайшет',
        'latitude' => '55.9405397',
        'longitude' => '98.0030649',
    ],
    'city915' => [
        'name' => 'Талдом',
        'latitude' => '56.7308993',
        'longitude' => '37.5276414',
    ],
    'city916' => [
        'name' => 'Талица',
        'latitude' => '57.0123359',
        'longitude' => '63.7322467',
    ],
    'city917' => [
        'name' => 'Тамбов',
        'latitude' => '52.7213021',
        'longitude' => '41.452258',
    ],
    'city918' => [
        'name' => 'Тара',
        'latitude' => '56.9159171',
        'longitude' => '74.3649643',
    ],
    'city919' => [
        'name' => 'Тарко-Сале',
        'latitude' => '64.9117649',
        'longitude' => '77.7610204',
    ],
    'city920' => [
        'name' => 'Таруса',
        'latitude' => '54.7236791',
        'longitude' => '37.1670866',
    ],
    'city921' => [
        'name' => 'Татарск',
        'latitude' => '55.2145894',
        'longitude' => '75.9740805',
    ],
    'city922' => [
        'name' => 'Таштагол',
        'latitude' => '52.7594505',
        'longitude' => '87.8477272',
    ],
    'city923' => [
        'name' => 'Тверь',
        'latitude' => '56.8585396',
        'longitude' => '35.9117898',
    ],
    'city924' => [
        'name' => 'Теберда',
        'latitude' => '43.4438408',
        'longitude' => '41.7414924',
    ],
    'city925' => [
        'name' => 'Тейково',
        'latitude' => '56.8542712',
        'longitude' => '40.5355289',
    ],
    'city926' => [
        'name' => 'Темников',
        'latitude' => '54.6309086',
        'longitude' => '43.2161785',
    ],
    'city927' => [
        'name' => 'Темрюк',
        'latitude' => '45.2611082',
        'longitude' => '37.445519',
    ],
    'city928' => [
        'name' => 'Терек',
        'latitude' => '43.4838439',
        'longitude' => '44.1402524',
    ],
    'city929' => [
        'name' => 'Тетюши',
        'latitude' => '54.936575',
        'longitude' => '48.8314915',
    ],
    'city930' => [
        'name' => 'Тимашевск',
        'latitude' => '45.6159358',
        'longitude' => '38.9350513',
    ],
    'city931' => [
        'name' => 'Тихвин',
        'latitude' => '59.6273809',
        'longitude' => '33.5072307',
    ],
    'city932' => [
        'name' => 'Тихорецк',
        'latitude' => '45.8546953',
        'longitude' => '40.1258702',
    ],
    'city933' => [
        'name' => 'Тобольск',
        'latitude' => '58.2016828',
        'longitude' => '68.2538392',
    ],
    'city934' => [
        'name' => 'Тогучин',
        'latitude' => '55.2250038',
        'longitude' => '84.4103867',
    ],
    'city935' => [
        'name' => 'Тольятти',
        'latitude' => '53.5206438',
        'longitude' => '49.389461',
    ],
    'city936' => [
        'name' => 'Томари',
        'latitude' => '47.7619957',
        'longitude' => '142.061508',
    ],
    'city937' => [
        'name' => 'Томмот',
        'latitude' => '58.9586939',
        'longitude' => '126.2875375',
    ],
    'city938' => [
        'name' => 'Томск',
        'latitude' => '56.4847036',
        'longitude' => '84.9481737',
    ],
    'city939' => [
        'name' => 'Топки',
        'latitude' => '55.2766036',
        'longitude' => '85.6153223',
    ],
    'city940' => [
        'name' => 'Торжок',
        'latitude' => '57.0412804',
        'longitude' => '34.9600691',
    ],
    'city941' => [
        'name' => 'Торопец',
        'latitude' => '56.5011791',
        'longitude' => '31.6354366',
    ],
    'city942' => [
        'name' => 'Тосно',
        'latitude' => '59.5406697',
        'longitude' => '30.8777872',
    ],
    'city943' => [
        'name' => 'Тотьма',
        'latitude' => '59.9735051',
        'longitude' => '42.7589701',
    ],
    'city944' => [
        'name' => 'Трехгорный',
        'latitude' => '54.8178174',
        'longitude' => '58.4465039',
    ],
    'city945' => [
        'name' => 'Троицк',
        'latitude' => '54.0844132',
        'longitude' => '61.5585503',
    ],
    'city946' => [
        'name' => 'Трубчевск',
        'latitude' => '52.5791314',
        'longitude' => '33.7660013',
    ],
    'city947' => [
        'name' => 'Туапсе',
        'latitude' => '44.1103707',
        'longitude' => '39.082645',
    ],
    'city948' => [
        'name' => 'Туймазы',
        'latitude' => '54.5999889',
        'longitude' => '53.6949081',
    ],
    'city949' => [
        'name' => 'Тула',
        'latitude' => '54.192017',
        'longitude' => '37.6153885',
    ],
    'city950' => [
        'name' => 'Тулун',
        'latitude' => '54.5571409',
        'longitude' => '100.5779402',
    ],
    'city951' => [
        'name' => 'Туран',
        'latitude' => '52.144932',
        'longitude' => '93.9172495',
    ],
    'city952' => [
        'name' => 'Туринск',
        'latitude' => '58.0394258',
        'longitude' => '63.698142',
    ],
    'city953' => [
        'name' => 'Тутаев',
        'latitude' => '57.8674237',
        'longitude' => '39.5368234',
    ],
    'city954' => [
        'name' => 'Тында',
        'latitude' => '55.1546401',
        'longitude' => '124.7468634',
    ],
    'city955' => [
        'name' => 'Тырныауз',
        'latitude' => '43.3981939',
        'longitude' => '42.9215127',
    ],
    'city956' => [
        'name' => 'Тюкалинск',
        'latitude' => '55.8705121',
        'longitude' => '72.1956156',
    ],
    'city957' => [
        'name' => 'Тюмень',
        'latitude' => '57.1530824',
        'longitude' => '65.5343118',
    ],
    'city958' => [
        'name' => 'Уварово',
        'latitude' => '51.9768835',
        'longitude' => '42.2529568',
    ],
    'city959' => [
        'name' => 'Углегорск',
        'latitude' => '49.0816311',
        'longitude' => '142.0693033',
    ],
    'city960' => [
        'name' => 'Углич',
        'latitude' => '57.5223866',
        'longitude' => '38.3019793',
    ],
    'city961' => [
        'name' => 'Удачный',
        'latitude' => '66.4072367',
        'longitude' => '112.3061653',
    ],
    'city962' => [
        'name' => 'Удомля',
        'latitude' => '57.8787885',
        'longitude' => '35.016716',
    ],
    'city963' => [
        'name' => 'Ужур',
        'latitude' => '55.3141977',
        'longitude' => '89.8333827',
    ],
    'city964' => [
        'name' => 'Узловая',
        'latitude' => '53.9731407',
        'longitude' => '38.1763104',
    ],
    'city965' => [
        'name' => 'Улан-Удэ',
        'latitude' => '51.8334378',
        'longitude' => '107.5841511',
    ],
    'city966' => [
        'name' => 'Ульяновск',
        'latitude' => '54.3080674',
        'longitude' => '48.3748717',
    ],
    'city967' => [
        'name' => 'Унеча',
        'latitude' => '52.8460665',
        'longitude' => '32.6757071',
    ],
    'city968' => [
        'name' => 'Урай',
        'latitude' => '60.1295842',
        'longitude' => '64.8040117',
    ],
    'city969' => [
        'name' => 'Урень',
        'latitude' => '57.4612547',
        'longitude' => '45.783394',
    ],
    'city970' => [
        'name' => 'Уржум',
        'latitude' => '57.1097612',
        'longitude' => '50.0056278',
    ],
    'city971' => [
        'name' => 'Урюпинск',
        'latitude' => '50.7904767',
        'longitude' => '42.0288589',
    ],
    'city972' => [
        'name' => 'Усинск',
        'latitude' => '65.9941116',
        'longitude' => '57.5570054',
    ],
    'city973' => [
        'name' => 'Усмань',
        'latitude' => '52.0444165',
        'longitude' => '39.7264516',
    ],
    'city974' => [
        'name' => 'Усолье',
        'latitude' => '59.4279356',
        'longitude' => '56.6837783',
    ],
    'city975' => [
        'name' => 'Усолье-Сибирское',
        'latitude' => '52.7567192',
        'longitude' => '103.6387694',
    ],
    'city976' => [
        'name' => 'Уссурийск',
        'latitude' => '43.79726',
        'longitude' => '131.9517262',
    ],
    'city977' => [
        'name' => 'Усть-Джегута',
        'latitude' => '44.083852',
        'longitude' => '41.971128',
    ],
    'city978' => [
        'name' => 'Усть-Илимск',
        'latitude' => '57.9431325',
        'longitude' => '102.7414683',
    ],
    'city979' => [
        'name' => 'Усть-Катав',
        'latitude' => '54.9261323',
        'longitude' => '58.1528067',
    ],
    'city980' => [
        'name' => 'Усть-Кут',
        'latitude' => '56.7928049',
        'longitude' => '105.7756883',
    ],
    'city981' => [
        'name' => 'Усть-Лабинск',
        'latitude' => '45.222676',
        'longitude' => '39.6930239',
    ],
    'city982' => [
        'name' => 'Устюжна',
        'latitude' => '58.8383671',
        'longitude' => '36.4425046',
    ],
    'city983' => [
        'name' => 'Уфа',
        'latitude' => '54.734853',
        'longitude' => '55.9578647',
    ],
    'city984' => [
        'name' => 'Ухта',
        'latitude' => '63.5564779',
        'longitude' => '53.7014202',
    ],
    'city985' => [
        'name' => 'Учалы',
        'latitude' => '54.3066965',
        'longitude' => '59.4126559',
    ],
    'city986' => [
        'name' => 'Уяр',
        'latitude' => '55.8131698',
        'longitude' => '94.3282148',
    ],
    'city987' => [
        'name' => 'Фатеж',
        'latitude' => '52.0918591',
        'longitude' => '35.8538912',
    ],
    'city988' => [
        'name' => 'Феодосия',
        'latitude' => '45.031878',
        'longitude' => '35.3824772',
    ],
    'city989' => [
        'name' => 'Фокино',
        'latitude' => '53.4554552',
        'longitude' => '34.4158537',
    ],
    'city990' => [
        'name' => 'Фролово',
        'latitude' => '49.7647809',
        'longitude' => '43.6648936',
    ],
    'city991' => [
        'name' => 'Фрязино',
        'latitude' => '55.9590154',
        'longitude' => '38.0409171',
    ],
    'city992' => [
        'name' => 'Фурманов',
        'latitude' => '57.2538043',
        'longitude' => '41.1053808',
    ],
    'city993' => [
        'name' => 'Хабаровск',
        'latitude' => '48.4647991',
        'longitude' => '135.0598811',
    ],
    'city994' => [
        'name' => 'Хадыженск',
        'latitude' => '44.412303',
        'longitude' => '39.5319151',
    ],
    'city995' => [
        'name' => 'Ханты-Мансийск',
        'latitude' => '61.0024344',
        'longitude' => '69.0183322',
    ],
    'city996' => [
        'name' => 'Харабали',
        'latitude' => '47.4089187',
        'longitude' => '47.2524467',
    ],
    'city997' => [
        'name' => 'Харовск',
        'latitude' => '59.9477728',
        'longitude' => '40.2000794',
    ],
    'city998' => [
        'name' => 'Хасавюрт',
        'latitude' => '43.2505191',
        'longitude' => '46.5852276',
    ],
    'city999' => [
        'name' => 'Хвалынск',
        'latitude' => '52.4950057',
        'longitude' => '48.1045147',
    ],
    'city1000' => [
        'name' => 'Хилок',
        'latitude' => '51.3635236',
        'longitude' => '110.458989',
    ],
    'city1001' => [
        'name' => 'Химки',
        'latitude' => '55.8886705',
        'longitude' => '37.4304154',
    ],
    'city1002' => [
        'name' => 'Холм',
        'latitude' => '57.1451036',
        'longitude' => '31.1787812',
    ],
    'city1003' => [
        'name' => 'Холмск',
        'latitude' => '47.0408637',
        'longitude' => '142.0416619',
    ],
    'city1004' => [
        'name' => 'Хотьково',
        'latitude' => '56.2515725',
        'longitude' => '37.9395225',
    ],
    'city1005' => [
        'name' => 'Цивильск',
        'latitude' => '55.8650132',
        'longitude' => '47.472967',
    ],
    'city1006' => [
        'name' => 'Цимлянск',
        'latitude' => '47.6477668',
        'longitude' => '42.093022',
    ],
    'city1007' => [
        'name' => 'Циолковский',
        'latitude' => '51.7624346',
        'longitude' => '128.121972',
    ],
    'city1008' => [
        'name' => 'Чадан',
        'latitude' => '51.2844482',
        'longitude' => '91.5789135',
    ],
    'city1009' => [
        'name' => 'Чайковский',
        'latitude' => '56.7780203',
        'longitude' => '54.1478482',
    ],
    'city1010' => [
        'name' => 'Чапаевск',
        'latitude' => '52.9289662',
        'longitude' => '49.8674222',
    ],
    'city1011' => [
        'name' => 'Чаплыгин',
        'latitude' => '53.2404794',
        'longitude' => '39.9671563',
    ],
    'city1012' => [
        'name' => 'Чебаркуль',
        'latitude' => '54.9819329',
        'longitude' => '60.3773305',
    ],
    'city1013' => [
        'name' => 'Чебоксары',
        'latitude' => '56.1439378',
        'longitude' => '47.2488718',
    ],
    'city1014' => [
        'name' => 'Чегем',
        'latitude' => '43.5672039',
        'longitude' => '43.5865338',
    ],
    'city1015' => [
        'name' => 'Чекалин',
        'latitude' => '54.0985105',
        'longitude' => '36.2474377',
    ],
    'city1016' => [
        'name' => 'Челябинск',
        'latitude' => '55.1603659',
        'longitude' => '61.4007858',
    ],
    'city1017' => [
        'name' => 'Чердынь',
        'latitude' => '60.4011184',
        'longitude' => '56.4801391',
    ],
    'city1018' => [
        'name' => 'Черемхово',
        'latitude' => '53.1369385',
        'longitude' => '103.090119',
    ],
    'city1019' => [
        'name' => 'Черепаново',
        'latitude' => '54.2206974',
        'longitude' => '83.3724392',
    ],
    'city1020' => [
        'name' => 'Череповец',
        'latitude' => '59.1269214',
        'longitude' => '37.9092243',
    ],
    'city1021' => [
        'name' => 'Черкесск',
        'latitude' => '44.2268637',
        'longitude' => '42.0467829',
    ],
    'city1022' => [
        'name' => 'Чермоз',
        'latitude' => '58.7842527',
        'longitude' => '56.1507562',
    ],
    'city1023' => [
        'name' => 'Черноголовка',
        'latitude' => '56.0100909',
        'longitude' => '38.3792328',
    ],
    'city1024' => [
        'name' => 'Черногорск',
        'latitude' => '53.8258425',
        'longitude' => '91.3259669',
    ],
    'city1025' => [
        'name' => 'Чернушка',
        'latitude' => '56.5161079',
        'longitude' => '56.0763919',
    ],
    'city1026' => [
        'name' => 'Черняховск',
        'latitude' => '54.6243928',
        'longitude' => '21.7969179',
    ],
    'city1027' => [
        'name' => 'Чехов',
        'latitude' => '55.1507175',
        'longitude' => '37.4532591',
    ],
    'city1028' => [
        'name' => 'Чистополь',
        'latitude' => '55.3699372',
        'longitude' => '50.628495',
    ],
    'city1029' => [
        'name' => 'Чита',
        'latitude' => '52.0340128',
        'longitude' => '113.4994884',
    ],
    'city1030' => [
        'name' => 'Чкаловск',
        'latitude' => '56.7651549',
        'longitude' => '43.2420193',
    ],
    'city1031' => [
        'name' => 'Чудово',
        'latitude' => '59.1247477',
        'longitude' => '31.6865406',
    ],
    'city1032' => [
        'name' => 'Чулым',
        'latitude' => '55.0906205',
        'longitude' => '80.9592152',
    ],
    'city1033' => [
        'name' => 'Чусовой',
        'latitude' => '58.2974725',
        'longitude' => '57.8193122',
    ],
    'city1034' => [
        'name' => 'Чухлома',
        'latitude' => '58.7534246',
        'longitude' => '42.6883783',
    ],
    'city1035' => [
        'name' => 'Шагонар',
        'latitude' => '51.5347357',
        'longitude' => '92.9199618',
    ],
    'city1036' => [
        'name' => 'Шадринск',
        'latitude' => '56.0870152',
        'longitude' => '63.6298234',
    ],
    'city1037' => [
        'name' => 'Шали',
        'latitude' => '43.148776',
        'longitude' => '45.9009577',
    ],
    'city1038' => [
        'name' => 'Шарыпово',
        'latitude' => '55.5389684',
        'longitude' => '89.1801557',
    ],
    'city1039' => [
        'name' => 'Шарья',
        'latitude' => '58.3761832',
        'longitude' => '45.4060762',
    ],
    'city1040' => [
        'name' => 'Шатура',
        'latitude' => '55.5777942',
        'longitude' => '39.5443781',
    ],
    'city1041' => [
        'name' => 'Шахты',
        'latitude' => '47.7084247',
        'longitude' => '40.2159154',
    ],
    'city1042' => [
        'name' => 'Шахунья',
        'latitude' => '57.6764773',
        'longitude' => '46.6129673',
    ],
    'city1043' => [
        'name' => 'Шацк',
        'latitude' => '54.0288845',
        'longitude' => '41.7182108',
    ],
    'city1044' => [
        'name' => 'Шебекино',
        'latitude' => '50.4005506',
        'longitude' => '36.8877988',
    ],
    'city1045' => [
        'name' => 'Шелехов',
        'latitude' => '52.2102462',
        'longitude' => '104.0973531',
    ],
    'city1046' => [
        'name' => 'Шенкурск',
        'latitude' => '62.1057423',
        'longitude' => '42.89959',
    ],
    'city1047' => [
        'name' => 'Шилка',
        'latitude' => '51.8495302',
        'longitude' => '116.033575',
    ],
    'city1048' => [
        'name' => 'Шимановск',
        'latitude' => '52.0052856',
        'longitude' => '127.7006559',
    ],
    'city1049' => [
        'name' => 'Шиханы',
        'latitude' => '52.1148241',
        'longitude' => '47.2022928',
    ],
    'city1050' => [
        'name' => 'Шлиссельбург',
        'latitude' => '59.9443923',
        'longitude' => '31.0334136',
    ],
    'city1051' => [
        'name' => 'Шумерля',
        'latitude' => '55.4961795',
        'longitude' => '46.4183534',
    ],
    'city1052' => [
        'name' => 'Шумиха',
        'latitude' => '55.2281833',
        'longitude' => '63.2902391',
    ],
    'city1053' => [
        'name' => 'Шуя',
        'latitude' => '56.8560743',
        'longitude' => '41.3802455',
    ],
    'city1054' => [
        'name' => 'Щекино',
        'latitude' => '54.0020749',
        'longitude' => '37.517686',
    ],
    'city1055' => [
        'name' => 'Щелкино',
        'latitude' => '45.4289847',
        'longitude' => '35.8251329',
    ],
    'city1056' => [
        'name' => 'Щелково',
        'latitude' => '55.9234303',
        'longitude' => '37.9784419',
    ],
    'city1057' => [
        'name' => 'Щигры',
        'latitude' => '51.8787808',
        'longitude' => '36.8910674',
    ],
    'city1058' => [
        'name' => 'Щучье',
        'latitude' => '55.20883',
        'longitude' => '62.7478475',
    ],
    'city1059' => [
        'name' => 'Электрогорск',
        'latitude' => '55.8778573',
        'longitude' => '38.7805239',
    ],
    'city1060' => [
        'name' => 'Электросталь',
        'latitude' => '55.7847718',
        'longitude' => '38.4446531',
    ],
    'city1061' => [
        'name' => 'Электроугли',
        'latitude' => '55.7170329',
        'longitude' => '38.2194049',
    ],
    'city1062' => [
        'name' => 'Элиста',
        'latitude' => '46.3082947',
        'longitude' => '44.2701417',
    ],
    'city1063' => [
        'name' => 'Энгельс',
        'latitude' => '51.4854893',
        'longitude' => '46.1267479',
    ],
    'city1064' => [
        'name' => 'Эртиль',
        'latitude' => '51.831024',
        'longitude' => '40.8074054',
    ],
    'city1065' => [
        'name' => 'Югорск',
        'latitude' => '61.3124504',
        'longitude' => '63.3364787',
    ],
    'city1066' => [
        'name' => 'Южа',
        'latitude' => '56.5926458',
        'longitude' => '42.0457159',
    ],
    'city1067' => [
        'name' => 'Южно-Сахалинск',
        'latitude' => '46.959133',
        'longitude' => '142.7381252',
    ],
    'city1068' => [
        'name' => 'Южно-Сухокумск',
        'latitude' => '44.6600972',
        'longitude' => '45.6499304',
    ],
    'city1069' => [
        'name' => 'Южноуральск',
        'latitude' => '54.4490124',
        'longitude' => '61.2581869',
    ],
    'city1070' => [
        'name' => 'Юрга',
        'latitude' => '55.7202689',
        'longitude' => '84.8885516',
    ],
    'city1071' => [
        'name' => 'Юрьевец',
        'latitude' => '57.3178701',
        'longitude' => '43.1110553',
    ],
    'city1072' => [
        'name' => 'Юрьев-Польский',
        'latitude' => '56.4938067',
        'longitude' => '39.6679311',
    ],
    'city1073' => [
        'name' => 'Юрюзань',
        'latitude' => '54.8546372',
        'longitude' => '58.4227116',
    ],
    'city1074' => [
        'name' => 'Юхнов',
        'latitude' => '54.7445873',
        'longitude' => '35.2424857',
    ],
    'city1075' => [
        'name' => 'Ядрин',
        'latitude' => '55.9406826',
        'longitude' => '46.2020765',
    ],
    'city1076' => [
        'name' => 'Якутск',
        'latitude' => '62.0280273',
        'longitude' => '129.7325717',
    ],
    'city1077' => [
        'name' => 'Ялта',
        'latitude' => '44.416366',
        'longitude' => '34.04455',
    ],
    'city1078' => [
        'name' => 'Ялуторовск',
        'latitude' => '56.649167',
        'longitude' => '66.297034',
    ],
    'city1079' => [
        'name' => 'Янаул',
        'latitude' => '56.2650336',
        'longitude' => '54.9298314',
    ],
    'city1080' => [
        'name' => 'Яранск',
        'latitude' => '57.304195',
        'longitude' => '47.8479185',
    ],
    'city1081' => [
        'name' => 'Яровое',
        'latitude' => '52.9251728',
        'longitude' => '78.5729898',
    ],
    'city1082' => [
        'name' => 'Ярославль',
        'latitude' => '57.6216145',
        'longitude' => '39.897878',
    ],
];
